# -*- coding: utf-8 -*-

import os

required_libraries = [
    'apscheduler',
    'pyrogram',
    'urllib3==1.26.9',
    'datetime',
    'pytube',
    'pytz',
]

for library in required_libraries:
    try:
        __import__(library)
    except ImportError:
        os.system(f'pip install {library}')

from apscheduler.schedulers.asyncio import AsyncIOScheduler


from pyrogram.errors import PhotoCropSizeSmall


from pyrogram import Client, filters , enums , emoji


from urllib.parse import quote


from datetime import datetime


from pytube import YouTube


import reloads


from importlib import reload


import unicodedata


import pyrogram


import requests


import importlib


import shutil


import random

import pytz
import time

import json

import os





api_id = 24241974


api_hash = "7d34b93387a00308b793a29de26994dd"


bot = Client("my_account", api_id=api_id, api_hash=api_hash)


admin = 'me'





fonts = {


    'Font1' : { '0': '𝟎','1': '𝟏','2': '𝟐','3': '𝟑','4': '𝟒','5': '𝟓','6': '𝟔','7': '𝟕','8': '𝟖','9': '𝟗' },


    'Font2' : { '0': '𝟘','1': '𝟙','2': '𝟚','3': '𝟛','4': '𝟜','5': '𝟝','6': '𝟞','7': '𝟟','8': '𝟠','9': '𝟡' },


    'Font3' : { '0': '⓪','1': '①','2': '②','3': '③','4': '④','5': '⑤','6': '⑥','7': '⑦','8': '⑧','9': '⑨' },


    'Font4' : { '0': '⁰','1': '¹','2': '²','3': '³','4': '⁴','5': '⁵','6': '⁶','7': '⁷','8': '⁸','9': '⁹' },


}





FoshList = ['کير گروهبان گارسيا تو كس ننت ','کولر تو کسسس ننت کنم','كير الاغ ملاسدرا تو كس خالت ','بدوووووووووو دلام کن به بکنه نسلت بعد سیک شو تو کس ننه بزرگت ','سی دی  تو خواهرت ','ناموس موز  ','پاور پیسی  تو کس مادرت','فرش تو کس مادرت ','ناموس هرزع مادر پولی جاکشششش','ناموس هپاتیتی ','ننه الکسیس','غلطگیر تو کون خواهرت','برس و بالا باش خار کسه ','تو یه کس ننه ای ک ننتو به من هدیه کردی تا خایه مالیمو کنی مگ نه خخخخ ','مادر تالبی  ','تخمام تو کسس خارت بالا باششش','مادرتوجرمیدم','موز تو کون ناموست ','تیز تر باش ','شوفاژ تو کون مادرت ','کیر تو نون شبت ','کیبورد تو کس خالت ','کتاب شیمی عمومی تو کون ننت ','خار کونی ','ریزور تو کس ننت ','تو نباید انقدر کند باشی کیری پدر ','هی محو نشو خار کس خراب ','چرا هی کس میگی ننه کس لرزشی؟ ','خار حرومی ','داش تو در میری ولی مادرت چی؟؟؟ ','عابربانک تو کون ننت ','هدفون تو کس خواهرت ','بادمجون تو ننت ','بطری اب تو کون ناموست ','اتو مو  تو کس ننت ','بالا باش میخام پیکان بار بکنم  ب  کس ننت بره  ','سطل اشغال تو کس خواهرت ','دستبند تو کس خواهرت ','نردبون تو کس خواهرت ','یهویی کس ننتو بکنم؟؟؟ ','سی دی  تو خالت ','پتو تو کس مادرت ','داش تو خودت خاسی بیناموس شی میفمی؟؟','ماست تو مادرت ','کس لیس ','سیک کن تو کس خارت نبینمت ','مادر کس  اتوماتیک ','ننت جقی کونی','خار کس شهوتی نباید شاخ میشدی ','کیرم شلاقی ب سورت مادرت بخوره بالا باش ','سیم لن تو کس ننت ','کیر اترنال تو کون مادرت ','میکروسکوپ تو کون خالت ','ناموس مشکوک ','کدو تو کون خالت ','ننه شورتی','کس ننت به سورت ضربدری ','نلرز بی ناموسس کیرم تو گس ننت','مانیتور تو کس خواهرت ','شلوار تو کس خالت ','موچین تو کون مادرت ','کیر باب اسفنجی تو کون خواهرت ','بيناموس بالا باش ميخوام کير کنم تو کس نواميست خهخهخههخخهخهخه  ','البوم تو کس مادرت ','خشاب کلاشینکف تو کس ننت ','کون ننت گذاشتم شاخ شدی','کیر خر سیا تو کون ننت کس ممبر','ننه پشمک   ','تو کیرمم نی کوندهع  ','نوشابه تو کون خالت ','ننتو به ده روش باقی مونده از کورش کبیر گاییدم ','بیا کیرمو بخور نزار باهاش ننتو بکنم','الووو خار کسه سدامو داری؟؟؟ ','یه ندایی تو دلم میگه خارتم از کیرم خوشش میاد ','كير تو ظرف غذا مادرت ','میز تو کس ننت ','سندلی خرابه تو ناموست ','بشاشم تو کسه جدت؟','انقد ضعیف نباش چسک ','میدونسی این کیرم قاب ننتو نداره؟؟ ','نون باگت تو کس خواهرت ','کرگدن تو کس خالت ','سفید کننده تو کس ناموست ','فرش تو کس ننت ','کمد تو کسه جدت','چرا هی ننتو میخای جر بدم؟؟ ','ننه کس کیشمیشی ','ننه پشمک ','کیبورد تو کس ناموست','راهی نی داش کس ننت  ','ننتو میگام خارت حسودی میکنه خارتو میگام ننت حسودی میکنه تخخخ تسمیم گرفتم جفتشونو باهم بگام ','کس مخ نامو ','لوله گاز تو کس مادرت ','كير تو دستپخت مادرت ','داش میخام چوب بیسبال رو تو کون ننت کنم محو نشو:|| ','بیا بگو کیر خوردم تا ولت کنم ','خار کس مکانیکی','لوبیا تو خواهرت ','كير تو نامه اعمال خالت ','كير تو پرده كس خالت ','تخم سگ برس ','پا بزن یتیمک کس خل  ','گوشی s3 neo تو کس مادرت ','کسس خارت   ','بيناموس بالا باش يه درسد هم فکر نکن ولت ميکنم','لیمو تو مادرت ','آهنگ رپر معروف حسین ابلیس یراس تو کس ننت ش؟؟؟ ','دم پلنگ سورتى تو كس مادرت ','بی منت ننتو گاییدم',' ننه کس تفنگی ','بیناموس ','آبکیرم تو کس جدت رفت نسلت به وجود اومد کونی ننه  ','پتو تو کس ننت ','تو یه کس ممبری که همش زیر کیرمی ','سویس پنیری تو خالت ','کارت ملی تو کون ناموست ','مادر جنده ','کیر اترنال تو کون خواهرت ','میز تلوزیون تو خالت ','تو کیفیت کار منو زیر سوال میبری ','شلوار جین تو خالت ','کون ممبر بالا باش ','کلوچه کوکی تو کون خواهرت ','کس محوی ','كير اسب زورو تو كس خواهرت ','ننه کسک','مودم دی لینک تو کس خواهرت','عسای موسی تو کس نسلت بره کس نسلت از وسط بازشه ','خاندانتو بپا درم ','روانی شدی  ','هارد اکسترنال تو کس خالت ','کس محوی  ','مادر کس شکلاتی تیز تر باش ','سطل اشغال تو کس ننت','چراغ قوه تو کس ننت ','مادر پیکانننننننن ','کابل ساتا تو کون خواهرت ','انگشتام ک دارم باهاشون کار میکنم ب کس ننت ','کیرمو بمالم به کسه خارت آبش بیاد   ','چراغ قوه تو کس خالت ','لباس کهنه  تو کس مادرت','بی ناموس','ننتو پاره کردم من/ ','باید تا سال 13 99 بالا باشی مادرتو بگام','هویج تو ناموست ','انگشت کسننت ','بی خایه ممبر همش  زیر کیرمی  دیده نمیشی  ','ننه الکسیس','عطر تو کون ننت ','ننه تخمی فیس ','کتاب ریاضیات گسسته تو کس مادرت ','كير تو روح ناپاك ننت ','نردبون تو کس ننت ','گوشی تو کس ننت ','ناموس خیابونی مادر جنده ممبر','سی پی یو تو کس خواهرت ','پا بزن یتیمک کس خل ','کس مخ ناموس','ننتو گاییدم شل ناموس','حرس میخوری ک چی تخم خر','  ننت ب زیرم  واس درد کیرم  ','بکنه ناموستم من ','ذربین ب کس ننت  ','موکت تو کس ننت ','دستگیره تو کون ناموست ','کیرم تو خاک ننت مادر کسع','چراغ  تو کس خواهرت ','یه جوری کسه ابجیتو بگام ک ننت گریه کنه','مادر کسده ','كير تو سنگ نوشته ها قبر خالت ','چراغ قوه تو کس خواهرت ','سویشرت تو کس مادرت ','کس لال  ','رژ لباس تو کس خواهرت ','خار کون پرپر شده  ',' مادر ثادراتی ','ننه حرسی ','گوشی تو کس ننت ','ساعت  تو کس ننت ','كير تو چهلم ننت ','عمودى تو كس ننت ','خونی ممبر  ','ولد خر','چراغ مطالعه تو کس خواهرت','کیر ملیوداس تو کس خالت ','سیب سبز تو ننت ',' کیر هافبک دفاعی تیم فرانسه که اسمش  یادم نی ب کس ننت  ','خار پلشت  ','راهی نیسسسس مادر کسع بدوووو ','کیر دوست  ','خونه تو کس خالت ','کتاب شیمی عمومی تو کون ناموست ','ویکتور هوگو ','ناموس سوسیس  ','داج بالا باش راهی نیس ننتومیگام ','میز تو کس ناموست ','کیر اسب کس ننت واس شاخیت ','گرگ تو کون مادرت','كير الاغ ملاسدرا تو كس ننت ','روباه تو کون ننت ','انگشت پای چپ ملخ تو کون خواهرت ','ماست تو ننت ','پنکه تو کس خواهرت ','کرم تو مادرت','خار سکسی تایپر مادرت ب زیره  کیرم  ','مودم سیسکو تو کس خواهرت ','ننه کس تفنگی  ','كير گروهبان گارسيا تو كس مادرت','دم اسب تو کون مادرت ','البوم تو کس خالت ','گوز ناموس','مادر جنده مادر سکسی','کلوچه نادری تو کس ننت ','کس ننه ','سی دی تو کس خالت ','دماغ پينوكيو تو كس مادرت ','كير تو ظرف غذا خالت ','كير تو نفس عاخر ننت ','کیر بوفالو تو کس ناموست ','كير تو روح ناپاك خواهرت ','اتو مو  تو کس خواهرت','شاخ گوزن تو کس خالت ','دم پلنگ سورتى تو كس خالت ','استین بلند تو کس خواهرت ','خیار تو کون خواهرت ','زرافه تو کون خواهرت ','پد موس تو کون ناموست ','کیره خره شرک تو کس سورتی آبجیت ','کیر اسب کس ننت واس شاخیت  ','بيناموس بالا باش  يه درسد هم فکر نکن ولت ميکنم ','کس ناموست با س سابون چون ناموست تو کفه کیرمه/ ','پودر لباسشویی تو خالت ','خار کس خونی از چی میترسی؟؟؟ ','مادر کونی ','کس ننتو غارت کردم','بیا بالا با کیر بکوبم پس کلت','گلابی تو کون ناموست ','کیر اترنال تو کون ناموست ','سگ خار ','ای ننه کیر دزد برس باع ','كير تو شب اول قبر خواهرت ','جعبه تو کس ننت ','گلدون تو کس ننت ',' بدو برس تا خایهامو تا ته نکردم تو کس ننت  ','تو هنوز مونده به من برسی  ','کرگدن تو کس ننت ','کیرم بابام تو کس ننت','ماکت کره زمین تو کون مادرت ','ننتو به ده روش باقی مونده از کورش کبیر گاییدم  ','كير تو دستپخت خالت ','سوراخ کون خارتو با یکمی تف بگام  ','تخته نرد تو خواهرت','کیرم  تو کس ننت ','عمودى تو كس ناموست ','مادر بیمه ایی کس ننتو میگام','كير تو تشييع جنازه ننت ','همه استیکرا تو کس ننت ','مادر معلول  ','خار خونی ','کیر ملیوداس تو کس ننت ','عابربانک تو کون خواهرت ','کیرم  تو کس خالت','کیر ملیوداس تو کون ننت ','عطر تو کون خواهرت ','حرسی شدی چخخ ','بی پدر  بی ناموس ','مبل تو کون مادرت ','کیرمو کردم کس ننت هار شدی؟ ','حرس نخور  مادرخر ','عمودى تو كس خواهرت ','نباید به این زودیا کم بیاری ','ناموس فداکار عمتو گاییدم','هواپیما با سرعت مافوق سوت تو کس مامانت/ ','ننه اسب:| ','نامویست دستمه  ','ننه الکسیس ','سی پی یو تو کس ناموست ','شمشیر تو کس خواهرت ','پرده اولین نسلتو من زدم ننه سلاخی شده ','خرس تو خالت','ننه کسو ','فن پیسی تو کس مادرت ','خیار تو کون ننت','اوبی زاده بچه سال  ','ناموس پشمک حاج عبلداله خور بالا باش و کل کن بايد بتوني کل کني چون من به همين زوديا و به همين راحتيا ولت نميکنم','مادرتو گاییدم','بفهم در حدم نیسی  ','خودکار بیک تو کونه خارت ',' داش برس راهی نی کیری شاخ شدی  ','کیر بوفالو تو کس خواهرت','نون باگت تو کس خالت','رژ لباس تو کس مادرت ','چراغ  تو کس ناموست ','عن تو کس ننت ','کلنگ تو کس ناموست ','ساطور تو کس خواهرت ','کیف پول تو کس ناموست ','کیر شتر تو کون ناموست ','ننهههععهه عنترشده ','كير رخش رستم تو كس ناموست ','ترازو تو کس ناموست ','دسته بازی تو کس خواهرت ',' ناموس مشکوک ','ساطور تو کس ناموست ','کیرم تو پردع مادرت ','كير ملوان زبل تو كس ننت ','تمام چیز هایی که درباره ی تو در سرم است ده ها کتاب میشود','بالا باش ناموستو بخورم مادر جنده','رم تو کس خواهرت ','میدونسی ننت واس منه؟؟؟  ','باند تو مادرت ','موز تو کون مادرت ','نامویست دستمه ','اسن کس ننت اگه فک کنی راهی هس که فرار کنی ','سشوار تو کس مادرت ','لیمو تو خواهرت ','تخم سگ ','ای کس ننه ','کیبورد خرابه تو خواهرت ','ماست تو خالت','ممبر فیلتر','کس شخمی ','باید هی این کیرمو ب کس ننت کنم تا بفهمی در حد من نیستی؟؟؟  ','لوسترای کاخ نیاوران تو کسسسسسسس ننت ','نوشابه تو کون مادرت ','گلدون تو کس خالت ','سندلی خرابه تو مادرت ','هارد اینترنال تو کون مادرت ','یخچال تو کون مادرت ','گوشی s3 neo تو کس ننت ','موکت تو کس مادرت ','بانک تو کس مادرت  ','عینک تو کس خواهرت ','بگو گوه خوردم ننتو ول کنم','ننه ساک مفتی ','كير ملوان زبل تو كس ناموست ','ننتو بخورم ','ننتو از کون گاییدم پسرم؟؟  ','داچ میخام کسس خارتو با تیق بزنم پارش کنم','موچین تو کون خالت ','تابلو تو کس خواهرت','کیبورد خرابه تو مادرت',' ننهه سولاخی ','مودم تی پی لینک تو کس مادرت ','تريلى با بارش تو كس خالت ','چرا حرسی میشی حالا حالا باید بگامت زوده حرسی شی  ','کدو تو کون مادرت ','کیر شتر تو کون ننت ','کس پاره مادر ','کیرم تا ته خشک خشک با کمی فلفل روش تو کس خارت  ','كيرم شيك تو كس مادرت ','بیا برو تو کس ننت درم ببند باع ','ارره تو کس ننت ','شوفاژ تو کون ناموست ','مودم تو کس ننت','تريلى با بارش تو كس ناموست ','ناخون گیر تو کس خالت ','کپسول آتشنشانی تو کسه ننت سیبیلای اسغر فرهادی تو کس ننت خخخ ','ننه کس تفنگی','گردنبند تو کس خالت ','تخخخخخخخشخشخشخش خارکسووو','اسن کس ننت اگه فک کنی راهی هس که فرار کنی  ','فلش تو کس خواهرت ','روباه تو کون ننت','الک  تو کون ناموست ','سیم aux تو کس ننت ','كير تو تشييع جنازه مادرت ','شلوار جین تو ناموست ','خالتو سر پل سراط گاييدم','توپ بدمینتون  تو ننت ','پرتغال تو مادرت ','كيرم تو سيرت ناپاك خواهرت','هندزفری تو کس خالت ',' کونی ممبر  ','کیر باب اسفنجی تو کون مادرت ','لیوان تو کس خالت ','اتو مو  تو کس مادرت ','اخخخخ نمیدونی چه حالی میده این کس ننت؟؟  ','کیرم تو رحم ننت ','پنکه تو کس خالت ','کارت بانک کشاورزی تو کس خواهرت ','سرم مو  تو کس ناموست ','چسسسس مادر ','کارت دانشجویی تو کون ننت ','خیخیخیخیخخیخخیخیخخییخیخیخخالهی خارتو بکنم  بی خار ممبر','کدو تو کون ناموست ','خیار تو کون خالت','جارو برقی تو کسسس خارت ','بالشت تو کس مادرت ','عابربانک تو کون مادرت ','كير رخش رستم تو كس ننت','گوشی s3 neo تو کس خواهرت ','اخخخخ نمیدونی چه حالی میده این کس ننت؟؟ ','گرگ تو کون خواهرت ','چرا پسرم باید واس خودم شاخ ش؟؟؟  ','طلا تو کس خواهرت','خشاب کلاشینکف تو کس ناموست ','کیر دایی فرانکی تو کس ننت ','تموم تکسام یه جا کس ناموست  ','ناخون گیر  تو کس ننت','هارد اکسترنال تو کس مادرت ','کیف پول تو کس ننت ','دمکنی تو کون خالت ','نخود تو ننت ','ب ننت بگو هی دور کیر من خط قرمز نکشه عه ','کاپشن تو کس ننت ','گلابی تو کون مادرت ','كير تو ظرف غذا ننت ','شلوار تو کس ناموست ','کیر لیس ','لنت تو کس ناموست ','سیب سبز تو ناموست ','کس شکلاتی ','دستگیره تو کون ننت ','کس طلا  ','هارد تو کس ننت','کس خارت تیز باش ','گردنبند تو کس خواهرت ','خربزه تو کون ناموست','میدونی اگ ننتو ول کنم چی میشه؟؟؟ ','لنت تو کس خالت ','ال ای دی تو کون خالت ','تابلو  تو کس ننت ','گاز تو کون مادرت ','لیوان تو کس ننت ','ادکلن تو کون مادرت','جورابم تو دهنه ننت خخخخخخخخخخخخخخخخخ ','كير اسب زورو تو كس ننت ','ایفون تسویری بزرگا تو کون ناموست ','چس نباش داش زیر کیرمی نگاه کن!  ','كير تو تشييع جنازه ناموست ','جعبه تو کس خالت ','كيرم چرخشى تو كس خواهرت ','کرگدن تو کس ناموست ','گلدون تو کس خواهرت','ای کس ممبری ','روانی شدی کس ننت','چرا محو میشی تو کس ناموست خار گاییده شده ها؟ ','خخخخخ بی پدرو ','بیل تو کس مادرت ','کلش کلنز تو کس اول اخرت بی مادر','کیری ممبر  ','ساطور تو کس خالت ','هندزفری تو کس ننت ','قناری تو کس خواهرت','ای کس ممبری  ','بالا باش کیرمو ناخودآگاه تو کس ننت کنم  ','لیمو تو ننت ','بیل تو کس ننت ','ساعت دیواری تو کس خواهرت ','روغن تو ناموست','لنت تو کس خواهرت ','خونه تو کس خواهرت','حرس میخوری ک چی تخم خر  ','کتاب ریاضیات گسسته تو کس خالت','بانک تو کس ننت','مهتابی تو کون مادرت ','مادرکنکشش  ','الک  تو کون خالت ','چشمای مادرتو میخام رو نافم تتو کنم ب یاد وقتی ک ساک میزنه نافم تو چشاشه ','كيرم شيك تو كس خواهرت ','حوله تو کس مادرت ','کارت ملی تو کون مادرت ','کیر بوفالو تو کس خالت ','ننه کون فنری','كيرم تو سيرت ناپاك مادرت ','كيرم نشسته دهن خواهرت ','نون باگت تو کس ناموست ','یعنی در اسل نونه خونتون از کسه ننتو جیبه من تامین میشه خخخخ ','سیب سبز تو خواهرت ','ننه روانی شده محو نباش تازه گاییدن ناموستو شروع کردم','یه روز ننتو نکنم و پولشو ندم از گشنگی میمیری  ','ولی مادرت کسش یه چیز دیگس ','نوک کیرمو میکنم تو گوش ننت','کارت بانک کشاورزی تو کس ناموست','ننتو سر پل سراط گاييدم ','تخمم کسخارت ','كير اسب زورو تو كس ناموست ','حرس نخور  مادرخر  ','کیر دنجر تو کون خواهرت ','کس خارت با دلایل کم','خار لیسر','عروسک تو کون خواهرت ','تخته تو ننت ','سی پی یو تو کس خالت ','ستون تو کس مادرت ','مادر خراباتی ','خیخیخیخیخخیخخیخیخخییخیخیخخ لهی خارتو بکنم  بی خار ممبر','بادمجون تو خالت ','کیرم از چهار جهت فرعی یراس تو کس ناموست  داش برس راهی نی کیری شاخ شدی','پایه میز تو کون ناموست ','برج میلاد تو کس مادرت بره خخخ','دسته مبل تو کون ننت ','بالا میگم ننال ','تک تک حروفای کیبوردم ب تک تک سوراخای ننت  ','ده خار کسه چس ممبرک','کتاب امادگی دفاعی تو کون خالت','عن تو کس خالت ','نردبون تو کس مادرت ','عن تو کس ناموست ','خیار تو کس ننت','خار بیابونی ','یتیمی تو ','کیر هرچی ممده  تو کون مادرت ','شاشیدم به رحم نجس ننت پدر خر  ابجی سلواتی ریدم تو قبر زنده مردت اوب پدر','اب گرمکن تو کون ناموست ','اسن جف پام تو کس بی پرده ننت','هارد اکسترنال تو کس ناموست ','میز تلوزیون تو ناموست ','پی اس فایو تو کس خالت  ','تلفن خونه تو کس مادرت ','مادر کس  اتوماتیک  ','طلا تو کس مادرت ','چرا حرسی میشی حالا حالا باید بگامت زوده حرسی شی ','شاشیدم سر قبر ننت تخخخخخخخخخخخخخخخخخخخخخخخخخ','اخمخ ناموس ','سرم مو  تو کس خواهرت ','كير تو دستا زحمت كش خالت',' خارتو با کیر میزنم تو سورتش جوری ک با دیورا بحرفه ','موز تو کون خالت ','خار پورن استار ','شارژر تو کس ناموست ','محوی چرا خار کونی شده','کیری ننه ','تو رو کس ننت چس نباش ','دسته مبل تو کون خالت ','سیب تو کس خواهرت ','ابجی بیپرده ','كير تو روح ناپاك ناموست ','زیر کیرم نباش تو سری خور مادر کونی','پایه میز تو کون ننت ','ناموس پشمالوو ','ناموس موز ','کیری پدر بدو ','ب ننت بگو هی دور کیر من خط قرمز نکشه عه  ','برنج تو خالت','دسته بیل  تو کس خالت','گاز تو کون خالت ','سگ ممبر اوب مادر تیز باش  ','كير تو لحظه مرگ خواهرت ','کیرعمو جانی تو کس ننت','کیر شتر تو کون خواهرت ','تو مادر جنده به کس ننت خندیدی شاخ شدی','کارت ملی تو کون خواهرت ','ساطور تو کس مادرت ','کار 98 تو کس خواهرت ','اتو مو سه کاره  تو کس خالت ','ای کیر ب قبر ننت بباره','استین بلند تو کس ننت ','دلقک ناموس','کلوچه نادری تو کس خالت ','تبلت تو کس خواهرت ','کمد تو کس ناموست ','رشته کوه آلپ به سورت زنجیره ای تو کس نسلت خخخخ','دم اسب تو کون خواهرت ','سطل اشغال تو کس خالت ','بالا باش میخام پیکان بار بکنم  ب  کس ننت بره ','بادمجون تو ناموست','تراول تو کس مادرت ','کیر علی دایی فوتبالیست معروف کس ننت ','کییر داداشیی خخ ','کیرم  تو کس خالت ','بیناموس زیر نباش مادر کالج رفته ','کیبورد خرابه تو ناموست ','برس کونی ','سشوار تو کس ناموست ',' مادر تلساز ','خار لیسر  ','سیب تو کس مادرت ','خارتو با کیر میزنم تو سورتش جوری ک با دیورا بحرفه  ','سی دی تو کس مادرت ','روانی شدنت تو کس مادرت خیخی ','مودم سیسکو تو کس ناموست ','هارد تو کس خواهرت','کیرم پس کلت ش تیز تر باش بینم ','خخخخخخخخخخخ کس ننت چرا خایه میکنی حالا',' تو دیدم  باش نرو تو کس ننت قایم شو  کیری پدر تو گوه خوردی واس اربابت شاخیدی','كير تو دستا زحمت كش خواهرت','سرورای تلگرام تو کون خواهرت ','سندلی تو کس ناموست ','خار حقیر','مادر بیمه ایی کس ننتو میگام ','بدو کس ننت کنم ','خارفیلم سکسی ','ایرپاد تو کون خالت','ای کیر ب قبر ننت بباره ','كير اسب زورو تو كس مادرت ','ننه جنده کیر تو نافه خارت ','کس ننت  ','بالا باش تایپ بده بخندم بهت ','انگشتر تو کس ننت ','تبلت تو کس مادرت ','کیبورد خرابه تو خالت ','روباه تو کون ناموست ','استین کوتاه تو کس ننت ','کیر ملیوداس تو کون مادرت ','دستبند تو کس خالت ','چس نباش داش زیر کیرمی نگاه کن! ','چوب پرده تو کس خالت ','مادر کسس طلا چرب','کتاب ریاضیات گسسته تو کس ننت ',' مادر خراباتی  ','هویج تو مادرت ','باید هی ننتو از کون جر بدم تا بفهمی که کیر منم نیسی؟؟؟ ','میز تلوزیون تو خواهرت ','چیپس تو ناموست','با کیرم بزنم رو کون ابجیت ','كيرم تو سيرت ناپاك ننت','سرورای تلگرام تو کون ننت ','کرم تو خالت ','خاهرجقی  ',' ننه جنده کیر تو نافه خارت ','ننه کس تپل ','ملافه تو کون خواهرت ','الکی  تو کون خواهرت','تلفن خونه تو کس ننت ','خربزه تو کون مادرت ','کیره شیر تو روحو روانه ابجیت','بیل تو کس خواهرت ','محوشدی خارسگ  ','کاکتوس تو کس خالت ','کیر مهدی تو کون خواهرت ','توپ بدمینتون  تو ناموست ','كير تو كانون گرم خونوادت','اناناس تو کون ننت ','کیر بوفالو تو کس ننت','رم تو کس ناموست ','سیب قرمز تو مادرت ',' خار کس شهوتی نباید شاخ میشدی  ','غلطگیر تو کون ننت ','مادر فلش شده جوری با کیر میزنم ب فرق سر ننت ک حافظش بپره  ','یخچال تو کون ننت ','کار 98 تو کس خالت ','كير تو پرده كس مادرت ','كير تو نفس عاخر ناموست ','ممبر کسده ','اخرش ننت واس منه دیگ:)  ','تخته سنگ تو کس مادرت','شاشم تو قبره جده پدریت ','تایپم تو کس ننت جا شه  ','انگشتر تو کس ناموست ','کیر ملیوداس تو کس خواهرت','کیر ملیوداس تو کس مادرت ','بخاری تو کس مادرت ','خرطوم فیل تو کون خواهرت','ترس نداره ک فقط من ننتو میکنم   ','سگ ننتو گایید ولدم  ','ننتو بخورم  ','کیری مقام ممبر','تو هنوز مونده به من برسی ','کس خارت به سورت مستطیلی ','كيرم افقى تو كس خواهرت ','کس پاره مادر  ','فرزندم تو همیشه زیره کیرم در حاله مالیدنی','دماغ پينوكيو تو كس خواهرت','کرم تو ناموست ','ستون تو کس خواهرت ','پیکان تو کس ننت خخخ کونی ممبر','کیر پرست','گوشی اپل تو کس خارت مادر کونی','شوفاژ تو کون ننت ','نارگیل تو کون خالت ','کیر هافبک دفاعی تیم فرانسه که اسمش  یادم نی ب کس ننت ','پتو تو کس خواهرت','عه دیدی چی شد؟؟ یادم رفتاانگشتام ک دارم باهاشون کار میکنم ب کس ننت','تراول تو کس ننت ','سیب تو کس خالت','هی رو ننت قفل میشم هی نمیتونیدفاع کنی؟؟؟  ','خار مادرتو گاییدم هعی:| ','كير تو نشيمنگاه خالت','عدس تو ننت ','ریدن به قبر ننت مادر جنده','تمام ترانزیستورای شرکت برق تو کس ننت','کارت گرافیک تو کس خالت ','خطکش تو کس خالت ','خار چوچول قلمبه ','اناناس تو کون ناموست','کتاب شیمی عمومی تو کون خالت ','بیناموس ننه','مادرتوجرمیدم ','ایوجی شیش با کوانتوم  تو کس ننت','غلطگیر تو کون ناموست ','کس خارت حاسله کاندوم اناریه پاره شده خخخخخ ','ادامس تو کس خالت ','کیر علی دایی فوتبالیست معروف کس ننت  ','حوله تو کس ناموست','ننه پلشت ممبر','بانک تو کس خواهرت  ','نخود تو مادرت','استین کوتاه تو کس خواهرت ','لگن تو کون ننت ','کیر هرچی ممده  تو کون ننت ','راهی نی داش کس ننت ','کیبوردم تو کسس ننت تایپ کن','فلش تو کس ننت ','جعبه تو کس مادرت ','انگشت پای چپ ملخ تو کون مادرت ','پماد  تو کس خالت','زیر نباش هی تخم سگ ','خایه مال خودمی تو ','كير رخش رستم تو كس خالت ','هی محو نشو کیر ممبر  ','ادکلن تو کون ننت ','ممبر دهاتی  ','دسته گل تو کس مادرت ','تو یه کس ممبری که همش زیر کیرمی  ','استین کوتاه تو کس مادرت','کیر هرچی ممده  تو کون خواهرت ','لگن تو کون ناموست ','دسته بیل تو کس خالت','كير تو چهلم خالت ','کارت دانشجویی تو کون ناموست ','میز تلوزیون تو ننت ','ننه تخمی ممبرگگککک','اب کون ','ننتو گاییدم شل ناموس ','الک  تو کون ننت ','سفید کننده تو کس خواهرت ','شاخ گوزن تو کس مادرت ','كير تو چهلم مادرت ','کارت دانشجویی تو کون مادرت ','سرورای گوگل تو کون خواهرت ','كير تو شب هفت ناموست','همت کنی کیرمو بخوری  ','باید هی این کیرمو ب کس ننت کنم تا بفهمی در حد من نیستی؟؟؟ ','سیب تو کس ناموست ','هی رو ننت قفل میشم هی نمیتونیدفاع کنی؟؟؟ ','شمشیر تو کس مادرت ','كير تو پرده كس ناموست ','بی مادر شدی رف ','رم تو کس مادرت ','کیر خودم ب کس ننت تخخخخخ  ','سویشرت تو کس ناموست ','گوشی تو کس مادرت ','کیر ناظرای زولا تو کون خالت ','کیره کینگ کنگ تو کسه سیاهه ننت  ','كير شتر ابوسفيان تو كس مادرت ','هندزفری تو کس خواهرت','دستگاه لیزر بدن تو کس ننت','ای کیرم ب ننت ','خیلی اتفاقی کیرم ب خارت  ','بیناموس ننه ','کلنگ تو کس خالت ','پودر لباسشویی تو ننت ','موز تو کون خواهرت','كير تو چهلم ناموست ','كير تو شب اول قبر خالت ','برگه تو کس ناموست ','كيرم شق تو كس ناموست ','گرگ تو کون خالت ','فرش هزار شونه ی دوازده متری تو کس ننت','برنج تو مادرت ','کیر شیر سلطان تو کس ننت  ','روغن تو ننت ','پرده ننتوبزنم  ','كير تو سنگ نوشته ها قبر خواهرت ','حیف کیرم که کس ننت کنم ','بالا و پایین تو کس ننت','اولین بار ک کیرمو در اوردم دادم دست خارت سکته ناقس زد از شدت ترسش  ','بخاری تو کس ناموست ','خخخخخخخخخخخ کس ننت چرا خایه میکنی حالا ','کیرم تونسلت ','دستگاه لیزر بدن تو کس خالت ','مادرفقیرشده ','روباه تو کون خالت ','سی دی  تو ناموست ','کیرررررررر تو چشای ناموست','کیر ترامپ ریس جمهور غیور امریکا که کیر منم نیس یه جا تو کس ننت ','برگه تو کس مادرت ','ماست تو خواهرت ','پماد  تو کس خواهرت','خاهرجقی ','كير تو سالگرد مرگ خواهرت ','بالا باش تایپ بده بخندم بهت',' کیرم از چهار جهت فرعی یراس تو کس ناموست  ','سیخ کباب تو گسس مادرت ','سی دی تو کس خواهرت ','تخته تو مادرت ','نخود تو خالت ','برگه تو کس خالت ','لیوان تو کس ناموست ','سی دی  تو مادرت ','مداد تو کس خواهرت ','شوفاژ تو کون خواهرت ','خیلی اتفاقی کیرم ب خارت ',' بالا باش من هی بکنم تو کس ننت تو هم هی نگا کن ','مودم تی پی لینک تو کس خواهرت ','میکروسکوپ تو کون ناموست ',' ننه کسه ','گاز تو کون خواهرت','گلابی تو کون خواهرت ','نارگیل تو کون خواهرت ','کیر ناظرای زولا تو کون مادرت ','دستبند تو کس ننت ','بی منت ننتو گاییدم ','خار کونی  ننتو به ده روش باقی مونده از کورش کبیر گاییدم','داش بالا باش تایپ بده  چرا کس شاخی ؟؟؟؟','تموم سریال های دنیا تو کس ناموست ','نارگیل تو کون ناموست ','خار کسلش  ','یخچال تو کون خواهرت ','كيرم چرخشى تو كس خالت ','باند تو ناموست ','شمعدونی تو کس خالت ','فیک ممبر مادر جنده تو کیرمم نیسی','البوم تو کس ناموست ','شیلنگ قلیون تو کس تنگ ابجیت','بطری اب تو کون خواهرت ','کیر ملیوداس تو کون خواهرت','خایه مال ','کرم تو خواهرت ','اخرش ننت واس منه دیگ:) ','پرتغال تو خواهرت','عرق سگی تو کسه خارت','کیر شتر تو کون مادرت ','دسته گل تو کس خالت ','اسن هی کس ننت ','خیار تو کون مادرت','خربزه تو کون خواهرت ','کیری ننه  ','هویج تو ننت','خار کس پنجی ','كير تو روح ناپاك مادرت ','هجا بندی بکن واسم کیر تو خارت ','تخته سنگ تو کس ناموست','كير ملوان زبل تو كس خالت ','بدو برس کس ننه','کار 98 تو کس ناموست','تموم فیلمهای هندی تو کسسس خارت','استین کوتاه تو کس خالت ','سیم aux تو کس مادرت ','دلام کردی به بکنه خارت تو کس ننه؟ ','ریزور تو کس ناموست ','ادکلن تو کون خالت ',' کیرم پس کلت ش تیز تر باش بینم ','کس نسلت به سورت مثلثی','فرش تو کس خالت','کیف پول تو کس مادرت ','خارت نمیزاشت کیرمو کنم تو کونش مگیفت بزرگه ولی من زوری کردم تا ته کردم تو کونش خارت بیهوش شد رفت تو کما/ ','بدو برس ','ننت باید بترسه  ','هندزفری تو کس ناموست','بیا کیرمو بخور نزار باهاش ننتو بکنم ','ننه لش ننه احمق  ','عن تو کس خواهرت ','ننت با عکسه کیرم جق میزنه روزایی ک نمیکنمش','ممبر کونده ','کاندوم تو کس ننت ','كيرم مجلسى تو كس خالت','کارت ملی تو کون خالت ','ننه کیر خور تو ب کس خارت خندیدی شاخیدی','تو ی کس ممبری که همش ب فکر فراری و توانایی کل با منو نداری ','دستبند تو کس مادرت','سشوار تو کس ننت ','حوله تو کس خواهرت ','استین بلند تو کس مادرت ','کیر هرچی ممده  تو کون خالت ','ستون تو کس ناموست ','تموم این  گُلای فرشمون به کس خارت خو؟؟؟ ','خار سگ تو یه کونی ک ','بیا برو تو کس ننت درم ببند باع  ','میخام ناموستو بخورم مادر خز ممبر','خار اوبی ','كير تو لحظه مرگ مادرت ','کیر هرچی ممده  تو کون ناموست ','ریدم تو سفتت نسل جنده ','تبلت تو کس ننت','کمد تو کس ننت ','لوله گاز تو کس خالت ','پایه میز تو کون مادرت','میخام رو کس ننت جق بزنم خخخخ','مهتابی تو کون ناموست ','میگامت','کس ننت مادر تو گاییدم خخخخخخخخخخخخخخخخخخخخخخخ ','كير تو شب هفت خالت','خار کس تعمیری','سیب قرمز تو ناموست ','انگشتر تو کس خالت','کلوچه نادری تو کس ناموست ','تایپم تو کس ننت جا شه ','اناناس تو کون خالت ','تخم خر  ','سرورای گوگل تو کون خالت','الهی خارتو بکنم  بی خار ممبر  مادرت از کس جر بدم  ک  دیگ نشاخی؟؟؟ ','مانیتور تو کس خالت','مانیتور تو کس ننت ','میز تو کس خواهرت ','كير تو دستپخت خواهرت ','تو ی کس ممبری که همش ب فکر فراری و توانایی کل با منو نداری  ','هارد اس اس دی تو کون ننت ','ای ک چی بی ناموسی خار توگایدم','کلوچه کوکی تو کون خالت ','خالت بورد تو کس مادر  ','کجایی پدرسگ ','هی بالا باش بالا تر:||| ','خارتم چیز خوبیه ها','ننه زباله ','ولد زنا بی ننه ','خربزه تو کون خالت ','خخخخخخخخ گریه نکن کیرم تو کسسسسس سیاه ننت','بالشت تو کس مادرت  ','  کیرمو کنم تو چشای خارت ','سرورای تلگرام تو کون ناموست ','سیم لن تو کس ناموست ','شل ناموسسسسس  ','بخاری تو کس ننت ','كير شتر ابوسفيان تو كس ناموست ','ترازو تو کس خواهرت ','کیرم لای ممه مادرت چسک','دسته بازی تو کس ننت ','کیرم تونسلت  ','بی خایه ممبر همش  زیر کیرمی  دیده نمیشی','حرسی شدی چرا کس ننتو خارت شده دیگ عادیه ک هر روز دارم میکنمشون حرس نخوررررررررررررر خایه مال کوچولو ','تخته نرد تو خالت ','خونه تو کس مادرت ','موچین تو کون ننت ','ایوجی شیش با کوانتوم  تو کس خواهرت ','روباه تو کون خواهرت ','تخم سگ برس  ','سفید کننده تو کس ننت ','ننت بورد تو کس مادر  ','سرم مو  تو کس ننت','مبل تو کون ناموست ','عقربه های ساعت کس ننت','تلوزیون تو مادرت ','ب پدر کس ناموس مادر ','سطل اشغال تو کس مادرت ','مودم تو کس مادرت ','دمکنی تو کون ننت ','الان هی ناموستو بگام هن','سویس پنیری تو ناموست ','عه دیدی چی شد؟؟ یادم رفتا','تخته تو خالت ','چیپس تو خالت ',' مادر کسده  ','بگو ننت واسم  یه ساک بزنه دعاش کنیم  ','كيرم شيك تو كس خالت ','بی خودو بی جهت کس ننت  ',' بی مادر ','مبل تو کون خواهرت ','مادر بيبي بالا باش ميخوام مادرت رو جوري بگام ديگه لب خند نياد رو لباش','لیمو تو خالت ','پی اس فایو تو کس مادرت','کیرم  تو کس مادرت ','دستگاه لیزر بدن تو کس ناموست ','تخته سیاهه مدرسه با معادلات ریاضیه روش تو کس ننت اسلا خخخخخخخ  ','ننت کس میده پول میگیره نون میخره براتون میدونستی  ','نوشابه تو کون ننت ','پرتغال تو ناموست ','از شیر خوار تا کیر از کالسکه سوار تا عسادار نسلتو گاییدم  ','مادر تو سری خور  خار کس وانتی','ال ای دی تو کون ننت ','گوشی تو کس خالت ','سگ  ناموس ','اتانول تو کونه ننت ','تخخخخخخخخخخخخخخخخخخخخخخخخخ کیس تو کس ننت','اتو مو سه کاره  تو کس ننت ','هویج تو خواهرت ','چراغ قوه تو کس مادرت ','كيرم شيك تو كس ناموست ','كير تو نامه اعمال ناموست ','میکروسکوپ تو کون ننت ','خار کسلش ','نارگیل تو کون ننت ','کیرم تو کس ننت همزمان کیره داداشمم تو کونه ننت لاشی ممبر ','ملافه تو کون مادرت ','كير تو سالگرد مرگ خالت ','دیگ برا بکن نسلت شاخ نشو فرزندم ','میز تو کس مادرت','هارد اس اس دی تو کون مادرت','مبل تو کون خالت','دسته گل تو کس خواهرت ','ممبر کونده','چراغ مطالعه تو کس مادرت ','دمکنی تو کون ناموست ','یه جوری کسه ابجیتو بگام ک ننت گریه کنه ','بی ننه ','حیف کیرم که کس ننت کنم  ','شلوار کردی تو کون مادرت ','کتاب امادگی دفاعی تو کون مادرت ','وقتی تو کس ننت تلمبه های سرعتی میزدم تو کمرم بودی بعد الان برا بکنه ننت شاخ میشی هعی  ','دم پلنگ سورتى تو كس ناموست ','دستگاه لیزر بدن تو کس خواهرت ','باید کس ننت ش تا ولت کنم ','دم اسب تو کون ناموست ','پاور پیسی  تو کس خواهرت','شلوار جین تو مادرت','ننهه سولاخی  ','تلوزیون تو خالت ','دسته مبل تو کون خواهرت','لباس کهنه  تو کس خواهرت ','عینک تو کس ننت ','کتاب امادگی دفاعی تو کون ننت ','بکنه نسلتم ','هارد اس اس دی تو کون ناموست','بدو کس ننت کنم  ','کیرم  تو کس ناموست ','عروسک تو کون مادرت ','سلیم لن تو کس خواهرت ','ملافه تو کون خالت ','زیر نباش هی تخم سگ  ','تريلى با بارش تو كس مادرت','سویشرت تو کس خواهرت ','کیرمو کردم کس ننت هار شدی؟','تخته تو ناموست ','روغن نارگیل تو کون خواهرت ','ساعت  تو کس خالت ','ناخون گیر  تو کس ناموست ','طلا تو کس ناموست ','هارد تو کس ناموست ','اجر پاره تو کس پاره خارت ','هندوانه تو کون ننت ','ملافه تو کون ننت ','تخته نرد تو ننت ','سندلی خرابه تو ننت','کیبورد تو کس ننت ','غلطگیر تو کون مادرت','تخخخخخخخخخخخخخخخخخخخ کس ننه ی ول ناموس ','کیر مهدی تو کون ننت ','چراغ مطالعه تو کس ناموست ','مودم تو کس خواهرت ','شلوار کردی تو کون خالت ','میخام بی ناموست کنم دیه شاخ نشی','روغن نارگیل تو کون مادرت ','داش برس راهی نی کیری شاخ شدی ','ساعت دیواری تو کس ننت ','غلطگیر تو کون خالت ','کیر ملیوداس تو کون خالت ','کار 98 تو کس ننت ','لنت تو کس مادرت ','ننه هورمونی','سویس پنیری تو مادرت ','تخم سگ','ننت ب زیرم  واس درد کیرم ','ننه مفتی','شمعدونی تو کس ناموست ','ایفون تسویری بزرگا تو کون ننت ','عدس تو خواهرت ','ننه سکس گروپی','مودم تو کس ناموست ','سرورای گوگل تو کون مادرت ','ساعت دیواری تو کس مادرت ','کسسسسسسس خارتو بگام با کاندوم خاردار/ ','پاور پیسی  تو کس خالت ','ممبر کسده  ','کیر دنجر تو کون مادرت ','ننه قفلی','موکت تو کس خواهرت ','کلنگ تو کس مادرت ','خرطوم فیل تو کون ناموست ','تف کنم لای کون ننت تخخخ ','تموم این  گُلای فرشمون به کس خارت خو؟؟؟  ','كير تو تشييع جنازه خواهرت ','كيرم شق تو كس خالت ','بالا میگم ننال  ','ننتو با کیرم دار میزنم ','ای ننه کیر دزد برس باع  ','پماد  تو کس مادرت ','موزه لوور فرانسه با تمام آثار تاریخیش تو کس ناموست ','ناموس سوسیس','کاکتوس تو کس خواهرت ','سویس پنیری تو ننت ','راهی نیسسسس مادر کسع بدوووو کیر خر سیا تو کون ننت کس ممبر','شمشیر تو کس ناموست ','کلنگ تو کس خواهرت ','یتمی مادرلش','کیر لیس  ','بادنجون سیا بزنم تو کسسس ننت جرش بدم','مادرت از کس جر بدم  ک  دیگ نشاخی؟؟؟','تک تک حروفای کیبوردم ب تک تک سوراخای ننت ','سی دی تو کس ننت','مادر تسلاح','بمولا چسی زیر نباش مادر جنده','تريلى با بارش تو كس خواهرت ','خخخخخخخخههههخخخخخخخ کس ننت بره پا بزن داداش ','كيرم نشسته دهن ناموست ','میزنم ننتو کس پر میکنم ک  شاخ  نشی','دسته مبل تو کون ننت','خارت جربدم  ','ای خزنامویس  ','ممبر کونی ','كير تو دستا زحمت كش ننت ','رم تو کس ننت','کیر ملیوداس تو کس ناموست ','بالشت تو کس خالت ','تخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخ خاله هاتو گاییدم','كير تو سنگ نوشته ها قبر ننت ','کیر همه شاخا تو کس اجیت ','ولد خر ','ننه کیر خور تو ب کس خارت خندیدی شاخیدی ','گردنبند تو کس ناموست','کیررررررررررررررررررر تو کسسسسسسسسسسس جدت ','ادکلن تو کون خواهرت ','تو کیرمم نی کوندهع ','بطری اب تو کون خالت ','کیر ناظرای زولا تو کون ناموست ','کس نن خار جقی','قلیون دو سیب با سه تا زغال رو سریش تو کونه ننت  ','ابجینو گاییدم','کس جدت به سورت دایره ای ','لباسشویی ال جی با ضمانت گلدایران تو کسه ناموست ','ساعت  تو کس خواهرت ','کتاب ریاضیات گسسته تو کس ناموست','کیرم  تو کس خواهرت ','ناموستو گاییدم','بیا کیرمو بگیر بلیس شاید فرجی شد ننت از زیر کیرم فرار کنه','ممنبرخودمی چخه ','كير تو تشييع جنازه خالت ','خطکش تو کس ناموست ','خار یتیم شده','چوب پرده تو کس خواهرت ','اتو مو  تو کس ناموست ','توپ بدمینتون  تو خواهرت ','شاشم تو چشای ننت خخخخ ','ارره تو کس ناموست ','شرت خارتو بکشم رو کیرم پارش کنم هن','ارره تو کس مادرت ','ای کیرم تو اول اخرت کسگش ','چاقوی زنجان تو کس ننت اسلا ','چوب پرده تو کس ناموست ','عطر تو کون ناموست ','كير تو نون آور خونتون ','ناموس انگولک شده خخخخ ','كير تو نفس عاخر خواهرت ','شاخ گوزن تو کس خواهرت ','مادرشکلککک  ','مودم دی لینک تو کس ننت','ممبر کونده  ','ای خزنامویس ','خار سگ ممبر','جاکششش مادر کیری ','کلوچه نادری تو کس مادرت ','ای کس ننه','مادر فلش شده جوری با کیر میزنم ب فرق سر ننت ک حافظش بپره ','دستمال تو ناموست ','واخ دولم تو چرا چسی بتایپ نن سگ','خارت لاشیه ','ای کیرم ب ننت  ','شمعدونی تو کس مادرت ','ناموس پشمالوو  ','انقد ضعیف نباش چسک','نخود تو خواهرت ','كير تو سالگرد مرگ ننت','مادرت بورد تو کس مادر  ','خار کس مکانیکی  ','شلوار کردی تو کون ناموست ','موچین تو کون خواهرت ','نارگیل تو کون مادرت','نوشابه پپسی تو کسه ننت','كير تو چهلم خواهرت ','چسسسس مادر  ','ممبر کونی میگم بالاتر کابل تو کون ننت','دستمال تو مادرت ','کیر تو قلب شکسته مادرت و ناموست','با جف پام بزنم رو کسس مادرت ','ننه شورتی ','روباه تو کون مادرت ','باند تو خالت ','تیز تر باش تخمی حال نمیکنم  ','کابل ساتا تو کون خالت ','بطری اب تو کون مادرت ','کیر تموم مُردهات ب کس ننت  ','سیب سبز تو مادرت ','ننه کسه  ','شلوار تو کس خواهرت ','لوله گاز تو کس ناموست','مودم دی لینک تو کس خالت ','بالا باش من هی بکنم تو کس ننت تو هم هی نگا کن ','پماد  تو کس ناموست','تخت تو کس خارت','خواهرتو سر پل سراط گاييدم ','خرطوم فیل تو کون ننت ','تخم خر ','کیرم پس کله مادرت کونده','انچنان کس ننتو جر بدم که گوه بخوری دیگه شاخ شی ','دستبند تو کس ناموست ','خار کس وانتی ','خار سکسی تایپر مادرت ب زیره  کیرم ','عینک تو کس خالت ','میکروسکوپ تو کون خواهرت ','تابلو  تو کس مادرت','ایوجی شیش با کوانتوم  تو کس ناموست','کس خارت دلام کن به بکنه ننت','مادر ریتمی ','سگ ممبر اوب مادر تیز باش ','كير تو شب هفت مادرت ','بوفالو تو کس مامان جونت  ','خار شلپ شلوپ ','هی محو نشو کیر ممبر ','بالشت تو کس ننت ','کمد تو کس خواهرت ','هندوانه تو کون مادرت','ناموسسس ریپی تاچ نن نن کن کس خارت','بالا باش کیرمو ناخودآگاه تو کس ننت کنم','کیرم تو کسس خالت ','چراغ  تو کس مادرت ','كير تو نشيمنگاه ننت ','رژ لباس تو کس خالت','كير تو دستا زحمت كش مادرت ','کاکتوس تو کس ننت ','دم پلنگ سورتى تو كس ننت ','کلوچه کوکی تو کون ناموست ','کار 98 تو کس مادرت ','مادرت از کس جر بدم  ک  دیگ نشاخی؟؟؟ ','انگشت پای چپ ملخ تو کون ناموست ','دستگاه لیزر بدن تو کس مادرت ',' کیررررررررررررررررررر تو کسسسسسسسسسسس جدت ','ننه کسک چسک  ممبر','خخخخ چس ممبرک ','کس خراب ','تخم خر','سیم لن تو کس مادرت ','چس ممبر  ','تخخخخخخخخخخخ پشمای زیره تخمم تو دهنه خارت اسلا ','خار کونی  ','دسته مبل تو کون مادرت ','ساعت  تو کس ناموست ','لوله گاز تو کس ننت','كيرم افقى تو كس مادرت ','خار کس گاوی ','کیر ناظرای زولا تو کون خواهرت ','عروسک تو کون خالت ','بیل تو کس خالت ','ایرپاد تو کون ناموست ','كير تو شب اول قبر مادرت','کتاب شیمی عمومی تو کون خواهرت ','کیف پول تو کس خواهرت ','یهویی کس ننتو بکنم؟؟؟  ','كير تو شب هفت ننت ','ال ای دی تو کون خواهرت','قناری تو کس ننت','ارره تو کس خالت ','راغ  تو کس ننت','تخم اسب ','ماکت کره زمین تو کون خالت ','کیر امید تو کون خالت ','پنکه تو کس ننت','کارت گرافیک تو کس مادرت ','روغن نارگیل تو کون خالت ','کارت دانشجویی تو کون خالت ','خارفیلم سکسی  ','ناموس چس دهاتی حقیر ممبرک','سیب قرمز تو ننت ','دستمال تو خالت ','لباس کهنه  تو کس خالت ','مادر خزخیل ','اخخههه میدونسی خارت هی کس میده؟؟؟ ','مودم سیسکو تو کس مادرت ','خارتو کسس کنم مادر قهوع','كير تو ظرف غذا ناموست ','کیر ملیوداس تو کون ناموست ','لگن تو کون خالت ','اتو مو سه کاره  تو کس مادرت ','كير اسب زورو تو كس خالت','ولد زنا ممبر کونی میگم بالاتر باش ','شارژر تو کس خواهرت ','ترازو تو کس خالت ','اب گرمکن تو کون مادرت','مامی باخته ? ','گلابی تو کون خالت ','کس خل ممبر  ','سفید کننده تو کس خالت ','داش تو در میری ولی مادرت چی؟؟؟','کونی ننه ی حقیر زاده ','ادامس تو کس مادرت ','كير تو نفس عاخر مادرت ','کاپشن تو کس ناموست ','پی اس فایو تو کس خواهرت  ','یالا بالاتر باش ببینمت مادر کونده ','گاز تو کون ناموست ','مادر تلساز  ','لوبیا تو مادرت ','خخخخخخخخخخخخخخخخ   پدرتو گاییدم','كير تو نون تو سفرتون','تخمام تو چشای خارت کیرم همزمان تو کونه مادرت','ناموسسسس کشوری ','ریدم تو دهن بابات  ','كير رخش رستم تو كس مادرت ','قناری تو کس خالت','لوله گاز تو کس خواهرت ','خطکش تو کس مادرت ','سیب قرمز تو خالت ','دسته بازی تو کس مادرت ','ایرپاد تو کون ننت ','استین بلند تو کس ناموست ','جعبه بیسکوییت جوین تو کس اجدادت','کیرم دهنت','مادر جنده','من هی با مادرت رابطه داشتم قبل اینکه تورو بدنیا بیارم','کس خارت منتظره کیرمه زود بلیس بدو ','هارد اینترنال تو کون ناموست','انگشتر تو کس خواهرت','کونی ممبر ','تراول تو کس خواهرت ','همش دارم تایپ میدم خار کسه برس  ','خشاب کلاشینکف تو کس خواهرت','سشوار تو کس خواهرت ','مادر بی پردع خار سکسی','بی خودو بی جهت کس ننت','كير رخش رستم تو كس خواهرت','موکت تو کس خالت ','مهتابی تو کون ننت ','كير الاغ ملاسدرا تو كس خواهرت','خخخخخخخ شل ناموسسس ممبر','ممبر دهاتی ','چرا تخمی هن چرا؟؟؟ ','کس لیس','كير تو نامه اعمال خواهرت ','عطر تو کون مادرت ','گرگ تو کون ننت ','کارت بانک کشاورزی تو کس مادرت ','دستمال تو ننت ','دسته گل تو کس ناموست ','سرورای گوگل تو کون ننت ','اتو مو  تو کس خالت','نوشابه تو کون ناموست ','دستمال تو خواهرت ','بالا باش خارتو گاییدم  ','روانی شدی خیار تو کس ننت','آبکیرم تو کس ننت','کلوچه کوکی تو کون ننت ','دماغ پينوكيو تو كس خواهرت ','خرس تو ناموست ','عمودى تو كس مادرت ','تراول تو کس ناموست ','قناری تو کس ناموست ','کیبورد خرابه تو ننت ','همت کنی کیرمو بخوری ','شارژرم تو کس ننت اسلا','کرم تو ننت ','كيرم افقى تو كس ناموست','کیرمو بلیس',' گوز ناموس ','عنم تو قبره جده مادریت ','سرورای تلگرام تو کون خالت ','بگو ن ن نن نن نن باشه کیرم لای ممه ابجیت خخخخخ','تخخخخخخخخخ ننه جنده روانی شده اوخیییییییییی','نوشابه تو کون خواهرت ','تخخخخخخخخخخخخخخخخخخخخخخخ تلمبه بسیار روی ننت زدم :)','كير تو پرده كس خواهرت','ممبر کیری ','دسته گل تو کس ننت ','دسته مبل تو کون ناموست ','پی اس فایو تو کس ننت  ','مادرکنکشش ','ناموست بورد تو کس مادر  ','عابربانک تو کون ناموست','دسته بیل  تو کس ناموست ','کپی پیس گوشیم ب کس ننت؟','ایرپاد تو کون خواهرت','خار کس مفتی','بالا باش من هی بکنم تو کس ننت تو هم هی نگا کن  ','فن پیسی تو کس ننت ','هندوانه تو کون ناموست ','پتو تو کس ناموست','کیر تموم مُردهات ب کس ننت ','بیا بالا با کیر بکوبم پس کلت  ','خشاب کلاشینکف تو کس خالت','توپ بدمینتون  تو مادرت ','ال ای دی تو کون مادرت ','ننت از بهترین پورن استار هاست','تموم تکسام یه جا کس ناموست ','بطری اب تو کون ننت','كير الاغ ملاسدرا تو كس ناموست ','ساطور تو کس ننت','کس خل ممبر ','سرم مو  تو کس خالت ','انگشتر تو کس مادرت','انچنان کس ننتو جر بدم که گوه بخوری دیگه شاخ شی  ','انگشت کوچیکه پام تو کس خواهرت ','نخود تو ناموست','چراغ مطالعه تو کس خالت ','ننه پریودیننه هفتی ','کیر اترنال تو کون خالت ','سویشرت تو کس ننت ','تخخخخخخخخخخخخخخ خایه کرده خایه ماله کس ننه ','کس ننت هخخخخخخخخخخخخخخخخخخخخخخخخخخخخخ','سطل اشغال تو کس ناموست ','بیا اسن کیرمو میدم دست باهاش بازی کن ','سیب تو کس ننت ','داعش ننتو پاره کنن مادر گوساله','خخخخخخخخ شل ناموس ریدی بالاتر','دسته بیل  تو کس ننت ','دمپای کفک تو کس مادرت خارسگ','دسته بیل  تو کس مادرت ','ستون تو کس خالت ','مادرتو سر پل سراط گاييدم ','ماست تو ناموست','كيرم افقى تو كس ننت ','اب معدنی تو کس ننت ','تلفن خونه تو کس خواهرت ','شاشیدم سر قبر بابات ',' محوشدی خارسگ ','كير تو سالگرد مرگ مادرت ','مودم تی پی لینک تو کس ننت','كير تو لحظه مرگ ناموست ','کیر خور ','راهی نی داش کس ننت','سویشرت تو کس خالت','عنم رو کسه سیاهه ننت','بادمجون تو خواهرت ','شاخ گوزن تو کس ناموست ','كير گروهبان گارسيا تو كس خالت ','گوشی s3 neo تو کس ناموست','مادر هیز ','مهتابی تو کون خالت ','مادر ریتمی','کیرم از چهار جهت فرعی یراس تو کس ناموست ','كيرم چرخشى تو كس ناموست ','سریع تر باش کیری','ناموس متحرک ','اتو مو سه کاره  تو کس خواهرت ','کیر پرست بی مادر','ترس نداره ک فقط من ننتو میکنم','كير ملوان زبل تو كس مادرت ','ناخون گیر  تو کس مادرت ','فلش تو کس خالت ','هیچ اتفاق خاسی نمیفته میرم سراغ خارت تخخخخخ ','تابلو  تو کس خواهرت','چراغ قوه تو کس ناموست ','كيرم مجلسى تو كس ننت ','کاپشن تو کس مادرت ','هارد اس اس دی تو کون خالت ','گوز ناموس ','هدفون تو کس ناموست ','مودم سیسکو تو کس ننت ','سی دی  تو ننت ','کس خارت تیز باش  ','چیپس تو خواهرت ','خواهرت بورد تو کس مادر  ','کارت بانک کشاورزی تو کس خواهرت','ناموس اختاپوس رو ننت قفلم میفمی؟؟؟؟ ','کیبورد تو کس ننت','بیناموس زیر نباش مادر کالج رفته  ','سندلی تو کس خواهرت ','ایوجی شیش با کوانتوم  تو کس خالت','بالا و پایین تو کس خارت ','سیب قرمز تو خواهرت ','هارد اینترنال تو کون خواهرت','سگ ننتو گایید ولدم ','سطل اشغال تو کس ','ناموستو سر پل سراط گاييدم','تلفن خونه تو کس خالت ','ادامس تو کس ننت ','عروسک تو کون ننت','استین کوتاه تو کس ناموست ','كير ملوان زبل تو كس خواهرت','لوبیا تو ننت ','کابل ساتا تو کون ناموست','فرش تو کس خواهرت ','ننه اموزشی  ','خخخ ناموست  ','ممبر کونی  ','لگن تو کون مادرت ','شمعدونی تو کس ننت ','از کیره خودمی فرزندم','خرطوم فیل تو کون خالت ','خارت جربدم ','کیر خر تو کس مادرت','کانودم تو کس ننت','هدفون تو کس خالت ','كيرم نشسته دهن خالت ','خر ناموس میخام نسلتو بگام بفهم','بالشت تو کس ناموست ','هارد اکسترنال تو کس ننت ','توپ بدمینتون  تو خالت ','عقربه های ساعت کس ننت  ','خربزه تو کون ننت ','كير تو نشيمنگاه مادرت','هاپ هاپ کن','مداد تو کس ناموست','هدفون تو کس ننت ','چراغ  تو کس خالت ','كيرم مجلسى تو كس مادرت ','بالشت تو کس خواهرت ','سیک کن تو کس خارت نبینمت  ','بی ننه  ممبر خار بیمار ','بالا باش من هی بکنم تو کس ننت تو هم هی نگا کن','سشوار تو کس خالت ','تو دیدم  باش نرو تو کس ننت قایم شو ','بیا کیرمو بگیر بلیس شاید فرجی شد ننت از زیر کیرم فرار کنه  ','نون باگت تو کس ننت ','مداد تو کس مادرت ','گرگ تو کون ناموست ','جعبه تو کس خواهرت','شمشیر تو کس ننت','تو دیدم  باش نرو تو کس ننت قایم شو  ','سیم aux تو کس خالت ','کیرم تو کمر ننت مادر کون گنده','درخت نخل تو کس خواهرت','میز تو کس خالت','کیر شتر تو کون خالت','کس ننت گذاشتم شاخ شدی','درخت نخل تو کس ننت ','مادر هرزع کیرم پس کله ابجیت','ساعت  تو کس مادرت ','ننه کسه ','باند تو ننت ','کیر امید تو کون مادرت ','عن تو کس مادرت ','داچ راهی نیس بالا باش ننتو بگام','کیر اترنال تو کون ننت ','زرافه تو کون ننت ','پودر لباسشویی تو ناموست ','کابل ساتا تو کون ننت ','خاور با هشت تن بارش تو کس ننت جا میشه بازم جا داره اون کسه غار شده ی ننت ','سیم لن تو کس خالت ','سندلی خرابه تو خالت ','پودر لباسشویی تو خواهرت ','دستگیره تو کون خالت','سیاره مریخ تو کس ننت اسلا','هویچ میکنم توگسسس ننت پارعش','پماد تو کس ناموست','شلوار جین تو خواهرت ','گلابی تو کون ننت ','دسته بازی تو کس خالت ','مودم تی پی لینک تو کس ناموست ','برینم تو قبره مرده هات ','ننه کون جنده شده ولد خر کس ننت','تو یه کیرخور بی خاسیت  ','کیرم تو کس تنگ ننت ','احمق خر میگم بگو ننت بیاد بساکه واسم  ','كير تو روح ناپاك خالت ','ای کس ننه  ','خار خونی  ','كير تو لحظه مرگ ننت ','ننه نزولی','درخت نخل تو کس مادرت','ناموس خراب کیرم تو کسسس ننت بی ناموسسس','رژ لباس تو کس ننت','كير تو شب هفت خواهرت ','درخت نخل تو کس ناموست','بانک تو کس ناموست  ','ال ای دی تو کون ناموست ','كير تو دستپخت ننت ','کس ممبر تو یع مادر سکسی ','هارد اینترنال تو کون ننت','حوله تو کس ننت ','ناموس کثیف ','کیر دایی فرانکی تو کس ننت  ','اسن کس ننت ب کیرم ','دم پلنگ سورتى تو كس خواهرت ','كيرم شق تو كس ننت ','ریزور تو کس خواهرت',' مادر کس  اتوماتیک ','كير تو سنگ نوشته ها قبر ناموست ','کسلیس ممبر ','موچین تو کون ناموست','خارتو میگام کیب بزنی بدووو نلرز','کتاب شیمی عمومی تو کون مادرت','موز تو کون ننت ','كير تو نشيمنگاه خواهرت ','شارژر تو کس مادرت','موش تو کس مادرت','مودم دی لینک تو کس ناموست','كير الاغ ملاسدرا تو كس مادرت','حوله تو کس خالت','ناموس حراج شده  ','ناموس مشکوک','کابل ساتا تو کون مادرت ','ننه کسو  ','چرخ فلک تو کسسس مادرت بدوو ','همین موس نو کس ننت','عطر تو کون خالت ','ننه مفتی  ',' خار پلشت ','ننه چاقل','فن پیسی تو کس خواهرت ','بانک تو کس خالت  ','گردنبند تو کس ناموست ','اناناس تو کون خواهرت','بادمجون تو خواهرت','مادر بيبي بالا باش ميخوام مادرت رو جوري بگام ديگه لب خند نياد رو لباش ','ننه مفتی ','قاره اسیا تو کسسسسسسسسسسسسسسس ننت',' مادر خراباتی ','خار کس خونی از چی میترسی؟؟؟  ','لیوان تو کس مادرت ','خار الکسیس','ننه زنجیری ','کارت گرافیک تو کس ننت','پارک چیتگر تو کون ننت پاره بشه ','کتاب ریاضیات گسسته تو کس خواهرت ','شلوار کردی تو کون خواهرت','ای کس  ناموست  ','ممبر کسو ','عدس تو ناموست','کس لیس  ','ریزور تو کس خواهرت ','خار پلشت ','گلدون تو کس مادرت ','کاپشن تو کس خواهرت ','دماغ پينوكيو تو كس خالت ','کیرمو از کس خارت میکنم تو از دهن ننت سرش میاد بیرون کسخول ناموس/','کارت گرافیک تو کس خواهرت ','ننه پریودی ','ناموستو سر پل سراط گاييدم ','سیم aux تو کس ناموست ','تلوزیون تو ننت ','كيرم چرخشى تو كس ننت ','خشاب کلاشینکف تو کس مادرت ','کس خراب  ','اسن کس ننت ب کیرم  ','دماغ پينوكيو تو كس ننت ','ناموست کس کهکشانی شد خخخخخخخخخخ ','ننه حرسی  ','دماغ اسحاق جهانگیری تو کس ننت','احترام بزار به کیره بکن ننت ','خار کس خونی از چی میترسی؟؟؟','بی ناموس مادرتو گاییدم ','کیرت کردم خخ','عدس تو خالت ','ریزور تو کس مادرت','ادامس تو کس ناموست ','گلدون تو کس ناموست ','ذربین ب کس ننت ','البوم تو کس خواهرت ','هدفون تو کس مادرت ',' ننهقناری ','بيناموس بالا باش ميخوام کير کنم تو کس نواميست خهخهخههخخهخهخه','سندلی تو کس ننت ','پایه میز تو کون خالت ','ننه کون جنده شده','طلا تو کس خالت ','کیر مهدی تو کون مادرت ','دو شقه میکنم ننتو ننه سلاخی شده','مانیتور تو کس مادرت ','نسلتو گاییدم بگو مرسی بابایی ','كير تو دستا زحمت كش ناموست ','ادامس تو کس خواهرت ','کیر گربه تو کس ننت  ','انگشت کوچیکه پام تو کس مادرت','خرس تو خواهرت','تريلى با بارش تو كس ننت','ننه اسب:|','دمکنی تو کون مادرت ','پرده ننتوبزنم','چرا ننت سوراخ سیاهه خارکسده/ ','کیرمو خودت بکن تو کس ننت بدوووووووووووو ','رم تو کس خالت ','کونده ننه  ','رژ لباس تو کس ناموست ','اما تمام چیز هایی که در دلم است تنها دو کلمه:','ستون تو کس ننت ','خنده های از ته دلم تو کس ممنیت تخخخخ ','كيرم مجلسى تو كس خواهرت ','كير تو دستپخت ناموست ','تخته نرد تو مادرت ','لوبیا تو ناموست','سفید کننده تو کس خواهرت','کس ننه  ','پی اس فایو تو کس ناموست','كيرم افقى تو كس ننت','یهویی کس ننتو بکنم؟؟؟  مادر بیمه ایی کس ننتو میگام','كير تو پرده كس ننت  ','پنکه تو کس مادرت ','هارد اس اس دی تو کون خواهرت ','مودم تو کس خالت','بالا باش کیرمو ناخودآگاه تو کس ننت کنم ','ناخون گیر  تو کس خواهرت ','ننه کس تپل','كيرم افقى تو كس خالت ','پد موس تو کون خواهرت','برنج تو خواهرت ','کیرم به کس ناموست ننه پشمالو ','خار خونی','زیر کیرم نباش تو سری خور مادر کونی ','میکروسکوپ تو کون مادرت ','انگشت کوچیکه پام تو کس ناموست ','خونی ممبر','کیرم تو کس طلات','هندوانه تو کون خواهرت ','بیا اسن کیرمو میدم دست باهاش بازی کن  ','برگه تو کس خواهرت','پایه میز تو کون خواهرت','ننه کس هفتی','ای کس ممبری','جعبه تو کس ناموست ','کدو تو کون خالت','بادمجون تو مادرت ','پرتغال تو خالت ','بیل تو کس ناموست ','ایفون تسویری بزرگا تو کون خواهرت ','کیف پول تو کس خالت ','تخمامو رو سورت ننت بمالم گریس ممبرک','کیر دنجر تو کون ننت ','شارژر تو کس خالت','طلا تو کس ننت ','اب گرمکن تو کون خالت ','گردنبند تو کس ننت ','روغن نارگیل تو کون ناموست ','كير تو لحظه مرگ خالت ','تورو کس ننت اگ یه درسدم فک کنی ننتو ول میکنم','میز تلوزیون تو مادرت ','میز تو کس مادرت ','اخخههه میدونسی خارت هی کس میده؟؟؟  ','كير شتر ابوسفيان تو كس ننت','شمعدونی تو کس خواهرت ','باند تو خواهرت ','بیا برو تو کس ننت درم ببند باع','الکی تو کون خواهرت','تهران بزرگ تو کس جدت','تلوزیون تو خواهرت','دم اسب تو کون خالت ','فن پیسی تو کس ناموست ','خخخخخخخخخخخخخخخخخخ  بادمجون تو کس ننت','حرسی شدنت تو کسسسسسسسس خارت خخخخخخخخخخخخخخخخ',' کس مادرتتت ','ننت ب زیرم  واس درد کیرم','كير شتر ابوسفيان تو كس خواهرت ','خونه تو کس ننت ','هندوانه تو کون خالت','دلقک ناموس  ','مودم تی پی لینک تو کس خالت ','سیگارم روشن تو کس ننت که کس کباب شه اسلا','ناخون گیر تو کس خواهرت','کیره خره قبرسی تو کونه خارت ','دمکنی تو کون خواهرت ',' میزنم ننتو کس پر میکنم ک  شاخ  نشی ','ارره تو کس خواهرت ','سندلی تو کس مادرت ','سیخ کبابی تو کس ننت  ','kir be namoset  ','کس ممنیت کنم خارت حسودی کنه؟','لوبیا تو خالت ','كيرم نشسته دهن مادرت ','لگن تو کون خواهرت','چوب پرده تو کس مادرت','اتو مو سه کاره تو کس ناموست','جعبه دستمال کاغذی تو کس خار جندت','ایرپاد تو کون مادرت ','كير ملوان زبل تو كس خواهرت ','یتیمی تو  ','یه جوری خارتو گاییدم ک ننت از درده خارت گریش گرفت ناموس گاییده شده  ','لاک پشت ننتو کسس کنه','خطکش تو کس ننت ','ساعت دیواری تو کس ناموست ','حرسی شدی چخخ کس ننت','شاخ گوزن تو کس ننت ','کلیده روحانی تو کس ممنیت تخخخخخخ ','فلش تو کس ناموست ','اسن هی کس ننت  ','اخخخخخ داشت یادم میرفت پسرم بگو ببینم کس ننت چند بخشه؟؟؟ ','شوفاژ تو کون خالت ','عدس تو مادرت','سی پی یو تو کس مادرت ','سرم مو  تو کس مادرت ','کس نسلت به سورت مثلثی ','اناناس تو کون مادرت ','کیرمو تا تخمام تو کونه خارت جا کردم هعی من تلمبه میزدم اون گریه میکرد ','کیرم تو کس ابجیت','کیبورد تو کس خواهرت ','ناموس انگشت شده ','دم اسب تو کون ننت ','ساعت دیواری تو کس خالت ','خطکش تو کس خواهرت','زجه نزن بی ناموس','احمق خر میگم بگو ننت بیاد بساکه واسم   ','کیرم تو روحه خار مادرت اسلا','خرس تو ننت','ماکت کره زمین تو کون ناموست ','اب کیرمو بپاشم تو دهن ننت','شارژر تو کس ننت ','بی پدر','خودت کیرمو بکن تو کس خارت و واسا تماشا کن چه کسی میگام ازش خخخخخخخخ ','ادکلن تو کون ناموست ','شلوار جین تو ننت ','کیر خور  ','انگشت کوچیکه پام تو کس ننت','کسسسسسسسسسسسس نسل چروک دار ','البوم تو کس ننت ','اب گرمکن تو کون ننت','سفید کننده تو کس مادرت ','پودر لباسشویی تو مادرت ','ترازو تو کس مادرت ','برنج تو ناموست ','خرطوم فیل تو کون مادرت','شلوار تو کس مادرت ','تلری تو کس ننت بره کسش پاره بشع','دماغ پينوكيو تو كس ناموست ','كيرم مجلسى تو كس ناموست ','سابون گلنار تو کسسس خارت مادر کونی','یخچال تو کون خالت ','گردنبند تو کس مادرت ','  مادر جنده  ','ننه هورمونی ','تلای ک ساختم تو کس خارت مادر کونی','اسپری دندن تو کسس تنگ خار کوچیکت','ای کس  ناموست ','تیز تر باش تخمی حال نمیکنم ','هندزفری تو کس مادرت','چوب پرده تو کس ننت ','تخته سنگ تو کس خواهرت ','ابلح ناموس','خرس تو مادرت ','بیل تو کس خواهرت','هویج تو خالت ','حرسی نشووووو کسسسس اون خاره جندت','كيرم نشسته دهن ننت ','تموم رکوردای گینس ب کس مادرت  ','کس ننت ول کن خایهامو راهی نی باید ننت بکنم','چس ناموس','مهران شاه کبیرم بشناس باید هی ننتو بگام ','چرا کس شاخی ؟؟؟؟ ','ریزور تو کس خالت ','موکت تو کس ناموست ','حقیر ممبره ننه کس شده','فرزند منی بی ناموس شده ','ننه زباله  ','گردن خارتو بخورم حشری شه؟','بخاری تو کس خواهرت','كيرم شيك تو كس ننت ','پنکه تو کس ناموست','لیوان تو کس خواهرت ','انگشت پای چپ ملخ تو کون ننت ','سگ خار  ','كير رخش رستم تو كس ننت ','كير گروهبان گارسيا تو كس ناموست ','روغن تو خواهرت ','میخای ولت کنم !  ','ناموس اختاپوس رو ننت قفلم میفمی؟؟؟؟  ','گوشی تو کس ناموست ','كير گروهبان گارسيا تو كس خواهرت','کس ننت ول کن خایهامو راهی نی باید ننت بکنم  ','کرگدن تو کس خواهرت ','كير تو نشيمنگاه ناموست ','کارت ملی تو کون ننت ','کارت دانشجویی تو کون خواهرت','سویس پنیری تو خواهرت ','کسلیس ممبر  ','كيرم شق تو كس مادرت ','كير تو نفس عاخر خالت ','نون باگت تو کس مادرت','مادر تالبی ','عروسک تو کون ناموست ','عابربانک تو کون خالت ','خیار تو کون ناموست ','چیپس تو مادرت ','انگشت فاکم تو کونه ناموست ','مداد تو کس ننت','کیر خودم ب کس ننت تخخخخخ','سیگاری که دستمه کس ننت  ','درخت نخل تو کس خالت ','مادر کونی  ','شمشیر تو کس خالت ','کارت بانک کشاورزی تو کس خالت ','كيرم شق تو كس خواهرت ','سیم aux تو کس خواهرت ','کیر باب اسفنجی تو کون ننت ','کس خارت شه فرزندم تا ابدیت بالا باش با کیر بزنم تو کس ناموستکیرمو شلاقی میکوبم تو کس ننت',' خار کونی','با کیر بکوبم به سورت خارت دندوناش بریزه ننه کس سیاه؟','فور ندی مادر کسع بدووو نن نن کن','میزنم ننتو کس پر میکنم ک  شاخ  نشی ','مادر سکس پکس','همه این تکستام تو کس اول اخرت مادر جن','کیرم تو کس خارت همزمان تخمام تو دهنه مادرت ','یخچال تو کون ناموست ','میدونسی ننت واس منه؟؟؟ ','پرده ابجی جونتو زدم من','مودم تی پی لینک تو کس ننت ','کیرمو از کس خارت میکنم تو از دهن ننت سرش میاد بیرون کسخول ناموس','کیر امید تو کون ناموست ','تبلت تو کس خالت','اتو مو سه کاره  تو کس ناموست ','پد موس تو کون خالت ','کیر دنجر تو کون خالت','ننه اموزشی کیرم دهنت','ملافه تو کون ناموست  ','تخخخخخخخخخخخخخخخخخخخخخخخخ خیار تو کس ننت','بدو برس تا خایهامو تا ته نکردم تو کس ننت ','بی خودو بی جهت کس ننت ','کیر دنجر تو کون ناموست ','بادمجون تو کس ننت','کدو تو کون خواهرت ','ننتو پاره کردم من','موز تو کون ناموست','نردبون تو کس خالت','کير تو پرده كس ننت','شلوار کردی تو کون ننت ','کیرم تو پرده پاره ناموست ','کارت گرافیک تو کس ناموست ','دسته بازی تو کس ناموست ','انگشت پای چپ ملخ تو کون خالت','خشاب کلاشینکف تو کس خواهرت ','مادر اتو زن چس ممبر بالاتر','بی مادر','حیف کیرم که کس ننت کنم','کیر ب سردر دهاتتون واس من شاخ میشی','هدفون تو کسسس اون خارت','پاور پیسی  تو کس ننت ','میخام گوشی تو دستت بترکونم خارسگ بفهم','ننه پریودی  ','چسک  ممبر','سیب سبز تو خالت ','مادر کسده  ','كير تو شب اول قبر ننت','ننه هفتی ','لباس کهنه  تو کس ننت','نردبون تو کس ناموست ','بخاری تو کس خالت','اب گرمکن تو کون خواهرت ','تخته سنگ تو کس خالت ','ننکسه ','كير تو كانون سرد خونوادت','کیری پدر تو گوه خوردی واس اربابت شاخیدی ','هی بالا باش بالا تر:|||  خخخخخخخخههههخخخخخخخ کس ننت بره پا بزن داداش','تبلت تو کس ناموست ','دسته بیل  تو کس خواهرت','ننه عمومی ','سرورای تلگرام تو کون مادرت','پتو تو کس خالت ','كيرم تو سيرت ناپاك خالت','هارد اکسترنال تو کس خواهرت','ایفون تسویری بزرگا تو کون خالت ','هعی باید کس ننت کنم من','کیر ناظرای زولا تو کون ننت ','مانیتور تو کس ناموست ','گاز تو کون ننت ','کاپشن تو کس خالت ','کمد تو کس مادرت ','خونی ممبر هار شدی','ابجی بیپرده','باید کس ننت ش تا ولت کنم  ','زرافه تو کون ناموست ','کدو تو کون ننت','لیمو تو ناموست','ماکت کره زمین تو کون ننت ','میکروسکوپ تو کون ننت','اسن میخام کس کون ناموستو بگام ','بی ننه','سگ ممبر اوب مادر تیز باش بيناموس بالا باش  يه درسد هم فکر نکن ولت ميکنم','ننه خیابونی ','انگشت کسننت  ','کیرم به کس ناموست ننه پشمالو','کونده ننه ','میدونستی اگ یه شب خارتو از کون نگام شبم روز نمیشه؟','کیرم کسخارت  ','میگامت ','کیرم تو ناموس نداشتته کس ننت فشار خورده','عمودى تو كس خالت','الان دارم با خنده مادرتو میگام یالا','چپ و راست تو کس ننت','یخچال بزنم تو کسسس خارت ','خارت لاشیه','انگشت کوچیکه پام تو کس خالت ','تو یه کیرخور بی خاسیت ','سی پی یو تو کس ننت ','کس ننتو خودم گاییدم لش شده',' کسس خارت  ','کیر فیل از پهنا تو کسمادرت','سندلی تو کس خالت ','مادر کس شکلاتی تیز تر باش','خونی ممبر ','تلفن خونه تو کس ناموست','تخته نرد تو ناموست ','مادر معلول  تیز باش ','فن پیسی تو کس خالت','مادر ثادراتی ','کلنگ تو کس ننت','كيرم چرخشى تو كس مادرت ','ننه خیاری  ','توپ بدمینتون  تو خالت','یتمی مادرلش ','شارژ تو کون بابات  ','عطر تو کون ناموست','مهتابی تو کون خواهرت','روغن تو خالت','تخخخخخ پمپ گاز تو کسسس خارت چس شاخ','ننتو از کون گاییدم پسرم؟؟','تو خیلی چسی من مادرتو میگام ','ایوجی شیش با کوانتوم  تو کس مادرت ','سوراخ کون ننتو خشک خشک بگام','خار اف سگ  ناموس','كير تو ظرف غذا خواهرت ','ننه جنده','مادر گاو دهاتی ممبرگ کیری','چرا پسرم باید واس خودم شاخ ش؟؟؟ ','نارگیل تو کون مادرت رم تو کس ننت ','پد موس تو کون مادرت','کیر باب اسفنجی تو کون ناموست ','18 چرخ تو کس مادرت','تموم رکوردای گینس ب کس مادرت','کس ننه','سرورای گوگل تو کون ناموست','تابلو  تو کس خالت ','ماکت کره زمین تو کون خواهرت','خونه تو کس ناموست ','حرمزاده ممبرککک مادر فلج','کتاب امادگی دفاعی تو کون ناموست ','کیر مهدی تو کون ناموست','انگشت کوچیکه پام تو کس ننت ','مودم دی لینک تو کس مادرت','ماشین لباس شوی تو درز کس ننت','كيرم تو سيرت ناپاك ناموست','ننت باید بترسه ','لیس بزنم خارتو ابش بیاد','کیر ناظرای زولا تو کون مادرت  ','سوسک تو کس مادرت','خار مرده چسک ممبر','كير تو سالگرد مرگ ناموست','مادر کس گشاد خار سگگگ بدووو نمال','کس ننت شه حاسل کاندوم پاره ی خاردار ','کس ننت','کس طلا  لگن تو کون ناموست ','خرس تو خواهرت ','خارکسه ممبرگ کیری ','زرافه تو کون خالت','کس خل ممبر','مداد تو کس خالت','کیبورد تو کس مادرت','فرش تو کس ناموست','ننه خیاری ','خارکسع شل ممبرگگگگگ','قناری تو کس مادرت ','برنج تو ننت','كير تو نامه اعمال ننت','روغن تو مادرت','همش دارم تایپ میدم خار کسه برس ','ننه کسسس تنگ ','کتاب امادگی دفاعی تو کون خواهرت ','مادر افلیج','پد موس تو کون ننت ','ناخون گیر  تو کس خالت ','اخخههه میدونسی خارت هی کس میده؟؟؟','تخم اسب  ','کاکتوس تو کس ناموست','همش زیره کیرمی داری خایه هامو میمالی خارکسده بیا بالا از کس و کون ناموست دفاع کن   ','تا ننتو نکنم اروم نمیگیگرم','تخم عن','کیر بوفالو تو کس مادرت','مودم سیسکو تو کس خالت ','همین موس نو کس ننت ','پماد  تو کس ننت ','لباس کهنه  تو کس ناموست','کیر مهدی تو کون خالت ','سگگ مادر نلرز ','تابلو  تو کس ناموست','خخخخ خار کسه تو گیچ شدی چی میگی','خارتم چیز خوبیه ها ','کمد تو کس خالت','کیرم دهن ننت واخ ','تخته سنگ تو کس ننت','الک  تو کون مادرت ','ترازو تو کس ننت ','تو خایه مالمی که الان میخای ننتو بفروشی بهم تا فقط بهت جواب سلام بدم','لنت تو کس ننت ','کیر امید تو کون ننت','دستگیره تو کون مادرت','بيناموس بالا باش  يه درسد هم فکر نکن ولت ميکنم  ','سی دی تو کس ناموست','ننه شورتی  ','وایی ب اون روزی که ننتو ول کنم ','تراول تو کس خالت ','كير تو نامه اعمال مادرت','مبل تو کون ننت ','گوشی تو کس خواهرت','کرگدن تو کس مادرت','ناموس تک چتر ممبر شل تایپ','كير تو سنگ نوشته ها قبر مادرت','تلوزیون تو ناموست ','کیرم بیشترین خاطرشو با کسسسسسسسس خارت داره','ب پدر کس ناموس مادر  ','مادر سکتر خار چتکر خخخخ','داچ عقب نمون میخام ننتو مدل سگی بگام','كير تو دستا زحمت كش خواهرت ','کارت بانک کشاورزی تو کس ننت ','ایفون تسویری بزرگا تو کون مادرت ','کیرم شلاقی ب سورت مادرت بخوره بالا باش خیخیخیخیخیخی کیرمو بلیس ','برگه تو کس ننت','داش میخام چوب بیسبال رو تو کون ننت کنم محو نشو:||  ','مبل تو کس ننت','سریع تر باش کیری ','هارد تو کس خالت ','میخای فرار کنی مادرتو بگام','نسل کیرخورده','کیرم تو قیافه ننت دهاتی','حقیر ممبر','ملافه تو کون ناموست ','ننه شهوتی','کلوچه کوکی تو کون مادرت','هارد اینترنال تو کون خالت ','هارد تو کس مادرت','کیرم تو تمام رویاهای ننت','موز تو کس ننت','دستگیره تو کون خواهرت ','سوسک تو معده مادرت','تخم عن ','کیرم لای شرت سبز خارت ','کیرم تو کس کون خار مادرت بی ننه','کیرلای پا مادرت ','کتاب ریاضیات گسسته تو کس ناموست  ','تخته تو خواهرت','روغن نارگیل تو کون ننت','لیوان تو کون باباتن','پرتغال تو ننت','هیچ اتفاق خاسی نمیفته میرم سراغ خارت تخخخخخ ابجیتو گاییدم','سندلی خرابه تو خواهرت','زیره خایه هام باش بمال برام کس ننه اروم بمال ک زخم شده از بس خارت خوردش ','ننتو کله پا میبندم با تبر از کسش شروع میکنم به پاره کردن تا سرش خیخی','گوشی s3 neo تو کس خالت','زرافه تو کون مادرت','روانی شدنت تو کسه خارت','ناموس باختع خارچسک','ناموس فداکار ','کیری فیسس چرا شاخ شدی','مادر تلساز ','کسس خارت  ','کس طلا ','کیری ممبر ','حرس میخوری ک چی تخم خر ','خارتو با کیر میزنم تو سورتش جوری ک با دیورا بحرفه ','خار کس مکانیکی ','کس لال ','بی پدر بی ناموس ',' کیر هافبک دفاعی تیم فرانسه که اسمش  یادم نی ب کس ننت ','کیر خودم ب کس ننت تخخخخخ ','ننه اموزشی ','کس ننت ول کن خایهامو راهی نی باید ننت بکنم ','میخای ولت کنم ! ','سیگاری که دستمه کس ننت ','اوبی زاده بچه سال ','شل ناموسسسسس ',' داش برس راهی نی کیری شاخ شدی ','مادر معلول تیز باش ','داش بالا باش تایپ بده چرا کس شاخی ؟؟؟؟','روانی شدی ','بفهم در حدم نیسی ','عقربه های ساعت کس ننت ','ناموس سوسیس ','خخخ ناموست ',' مادر کسده ','بیا کیرمو بگیر بلیس شاید فرجی شد ننت از زیر کیرم فرار کنه ','  ننت ب زیرم  واس درد کیرم ',' کیرم از چهار جهت فرعی یراس تو کس ناموست ','بيناموس بالا باش ميخوام کير کنم تو کس نواميست خهخهخههخخهخهخه ','ننه پشمک  ','کیرم از چهار جهت فرعی یراس تو کس ناموست داش برس راهی نی کیری شاخ شدی','پرده ننتوبزنم ','چس ممبر ','مادرشکلککک ',' خار کس شهوتی نباید شاخ میشدی ','بیا بالا با کیر بکوبم پس کلت ','ننتو از کون گاییدم پسرم؟؟ ','بالا باش خارتو گاییدم ','الهی خارتو بکنم  بی خار ممبر مادرت از کس جر بدم  ک  دیگ نشاخی؟؟؟ ','کیر دوست ','مادر معلول ','ننهه سولاخی ','تموم رکوردای گینس ب کس مادرت ','دلقک ناموس ',' بدو برس تا خایهامو تا ته نکردم تو کس ننت ',' تو دیدم  باش نرو تو کس ننت قایم شو کیری پدر تو گوه خوردی واس اربابت شاخیدی','کس ننت ','کیرم کسخارت ','بی خایه ممبر همش  زیر کیرمی  دیده نمیشی ','یهویی کس ننتو بکنم؟؟؟ مادر بیمه ایی کس ننتو میگام','ننه کس تفنگی ','ترس نداره ک فقط من ننتو میکنم  ','خار لیسر ','  مادر جنده ','مادر تو سری خور خار کس وانتی','محوشدی خارسگ ',' کونی ممبر']





if not os.path.isdir("data"):


    os.makedirs("data")





    with open("data/TimeName.txt", "w") as file1:


        file1.write("off")





    with open("data/TimeBio.txt", "w") as file2:


        file2.write("off")


    with open("data/Font.txt", "w") as file2:


        file2.write("Font1")





    with open("data/italic.txt", "w") as file2:


        file2.write("off")





    with open("data/part.txt", "w") as file2:


        file2.write("off")





    with open("data/bold.txt", "w") as file2:


        file2.write("off")





    with open("data/link.txt", "w") as file2:


        file2.write("off")





    with open("data/underline.txt", "w") as file2:


        file2.write("off")





    os.makedirs("data/action")





    with open("data/action/playing.txt", "w") as file2:


        file2.write("off")





    with open("data/action/typing.txt", "w") as file2:


        file2.write("off")





    with open("data/action/RECORD_VIDEO.txt", "w") as file2:


        file2.write("off")





    with open("data/action/CHOOSE_STICKER.txt", "w") as file2:


        file2.write("off")





    with open("data/action/UPLOAD_VIDEO.txt", "w") as file2:


        file2.write("off")





    with open("data/action/UPLOAD_DOCUMENT.txt", "w") as file2:


        file2.write("off")





    with open("data/action/UPLOAD_AUDIO.txt", "w") as file2:


        file2.write("off")





    with open("data/action/SPEAKING.txt", "w") as file2:


        file2.write("off")








@bot.on_message(pyrogram.filters.photo)


async def onphoto( client,message) :


    try :


        await bot.send_chat_action(chat_id=message.chat.id , action=enums.ChatAction.SPEAKING)


        if message.photo.ttl_seconds :


            rand = random.randint(1000, 9999999)


            local = f"downloads/photo-{rand}.png"


            await bot.download_media(message=message.photo.file_id, file_name=f"photo-{rand}.png")


            await bot.send_photo(chat_id=admin, photo=local, caption=f"🔥 New timed image {message.photo.date} | time: {message.photo.ttl_seconds}s")


            os.remove(local)


            


    except :


        pass








@bot.on_message(pyrogram.filters.video)


async def onvideo(client, message) :


    try :


        if message.video.ttl_seconds :


            rand = random.randint(1000, 9999999)


            local = f"downloads/video-{rand}.mp4"


            await bot.download_media(message=message.video.file_id, file_name=f"video-{rand}.mp4")


            await bot.send_video(chat_id=admin, video=local, caption=f"🔥 New timed video {message.video.date} | time: {message.video.ttl_seconds}s")


            os.remove(local)


    except :


        pass








async def TimeName():


    with open("data/TimeName.txt", "r") as file:


        TimeName = file.read()


    if TimeName == "on" :


        tz = pytz.timezone("Asia/Tehran")


        now = datetime.now(tz)


        if ( now.strftime("%S") == "00") :





            number = now.strftime("%H:%M")


            with open("data/Font.txt", "r") as file2:


                FONT = file2.read()


            if FONT == "Random":


                


                try:


                    selected_font = random.choice(list(fonts.keys()))


                    tz = pytz.timezone("Asia/Tehran")


                    now = datetime.now(tz)


                    current_time = now.strftime("%H:%M")





                    converted_time = ''.join([fonts[selected_font].get(char, char) for char in current_time])





                    await bot.update_profile(last_name=converted_time)


                except :


                    pass


            else:


                number_unicode = ''.join([fonts[FONT][c] if c in fonts[FONT] else c for c in str(number)])


                await bot.update_profile(last_name=number_unicode)








async def TimeBio():


    with open("data/TimeBio.txt", "r") as file:


        TimeBio = file.read()


    if TimeBio == "on" :


        tz = pytz.timezone("Asia/Tehran")


        now = datetime.now(tz)


        if ( now.strftime("%S") == "00") :





            number = now.strftime("%H:%M")


            with open("data/Font.txt", "r") as file2:


                FONT = file2.read()


            if FONT == "Random":


                


                try:


                    selected_font = random.choice(list(fonts.keys()))


                    tz = pytz.timezone("Asia/Tehran")


                    now = datetime.now(tz)


                    current_time = now.strftime("%H:%M")





                    converted_time = ''.join([fonts[selected_font].get(char, char) for char in current_time])


                except :


                    pass


                await bot.update_profile(bio="Time Now : "+converted_time)








            else:


                number_unicode = ''.join([fonts[FONT][c] if c in fonts[FONT] else c for c in str(number)])


                await bot.update_profile(bio="Time Now : "+number_unicode)











scheduler = AsyncIOScheduler()


scheduler.add_job(TimeName, "interval", seconds=1)


scheduler.add_job(TimeBio, "interval", seconds=1)








@bot.on_message(filters.user(admin))


async def admins(client , message):


    text = message.text


    from_id = message.chat.id


    if not os.path.isdir(f"data/{admin}"):


        os.makedirs(f"data/{admin}")


        profileBio = await bot.invoke(pyrogram.raw.functions.users.GetFullUser(id=await bot.resolve_peer(admin)))





        Name = message.from_user.first_name


        ProfilePhoto = message.from_user.photo.big_file_id


        with open(f"data/{admin}/bio.txt", "w" , encoding="utf-8") as file2:


            file2.write(profileBio.full_user.about)





        with open(f"data/{admin}/name.txt", "w" , encoding="utf-8") as file1:


            file1.write(Name)





        local = f"data/{admin}/profile.png"


        await bot.download_media(message=ProfilePhoto, file_name=local)





    if message.text == "TimeName on":


        with open("data/TimeName.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='TimeName is on' , message_id=message.id)





    if message.text == "TimeName off":


        with open("data/TimeName.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='TimeName is off' , message_id=message.id)








    if message.text == "TimeBio on":


        with open("data/TimeBio.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='TimeBio is on' , message_id=message.id)





    if message.text == "TimeBio off":


        with open("data/TimeBio.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='TimeBio is off' , message_id=message.id)











    if message.text == "italic on":


        with open("data/italic.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='italic is on' , message_id=message.id)





    if message.text == "italic off":


        with open("data/italic.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='italic is off' , message_id=message.id)





    if message.text == "part on":


        with open("data/part.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='part is on' , message_id=message.id)





    if message.text == "part off":


        with open("data/part.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='part is off' , message_id=message.id)








    if message.text == "bold on":


        with open("data/bold.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='bold is on' , message_id=message.id)





    if message.text == "bold off":


        with open("data/bold.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='bold is off' , message_id=message.id)





    if message.text == "link on":


        with open("data/link.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='link is on' , message_id=message.id)





    if message.text == "link off":


        with open("data/link.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='link is off' , message_id=message.id)





    if message.text == "underline on":


        with open("data/underline.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='underline is on' , message_id=message.id)





    if message.text == "underline off":


        with open("data/underline.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='underline is off' , message_id=message.id)





    if message.text == "playing on":


        with open("data/action/playing.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='playing action is on' , message_id=message.id)





    if message.text == "playing off":


        with open("data/action/playing.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='playing action is off' , message_id=message.id)





    if message.text == "typing on":


        with open("data/action/typing.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='typing action is on' , message_id=message.id)





    if message.text == "typing off":


        with open("data/action/typing.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='typing action is off' , message_id=message.id)





    if message.text == "RECORD_VIDEO on":


        with open("data/action/RECORD_VIDEO.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='RECORD_VIDEO action is on' , message_id=message.id)





    if message.text == "RECORD_VIDEO off":


        with open("data/action/RECORD_VIDEO.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='RECORD_VIDEO action is off' , message_id=message.id)





    if message.text == "CHOOSE_STICKER on":


        with open("data/action/CHOOSE_STICKER.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='CHOOSE_STICKER action is on' , message_id=message.id)





    if message.text == "CHOOSE_STICKER off":


        with open("data/action/CHOOSE_STICKER.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='CHOOSE_STICKER action is off' , message_id=message.id)





    if message.text == "UPLOAD_VIDEO on":


        with open("data/action/UPLOAD_VIDEO.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='UPLOAD_VIDEO action is on' , message_id=message.id)





    if message.text == "UPLOAD_VIDEO off":


        with open("data/action/UPLOAD_VIDEO.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='UPLOAD_VIDEO action is off' , message_id=message.id)





    if message.text == "UPLOAD_DOCUMENT on":


        with open("data/action/UPLOAD_DOCUMENT.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='UPLOAD_DOCUMENT action is on' , message_id=message.id)





    if message.text == "UPLOAD_DOCUMENT off":


        with open("data/action/UPLOAD_DOCUMENT.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='UPLOAD_DOCUMENT action is off' , message_id=message.id)





    if message.text == "UPLOAD_AUDIO on":


        with open("data/action/UPLOAD_AUDIO.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='UPLOAD_AUDIO action is on' , message_id=message.id)





    if message.text == "UPLOAD_AUDIO off":


        with open("data/action/UPLOAD_AUDIO.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='UPLOAD_AUDIO action is off' , message_id=message.id)





    if message.text == "SPEAKING on":


        with open("data/action/SPEAKING.txt", "w") as file:


            file.write("on")


        await bot.edit_message_text(chat_id=message.chat.id , text='SPEAKING action is on' , message_id=message.id)





    if message.text == "SPEAKING off":


        with open("data/action/SPEAKING.txt", "w") as file:


            file.write("off")


        await bot.edit_message_text(chat_id=message.chat.id , text='SPEAKING action is off' , message_id=message.id)











    if 'SetFont ' in str(message.text):


            try:


                if message.text == "SetFont 1":


                    with open("data/Font.txt", "w") as file2:


                        file2.write("Font1")


                    await bot.edit_message_text(chat_id=message.chat.id , text='The Font1 is Seted' , message_id=message.id)


                


                elif message.text == "SetFont 2":


                    with open("data/Font.txt", "w") as file2:


                        file2.write("Font2")


                    await bot.edit_message_text(chat_id=message.chat.id , text='The Font2 is Seted' , message_id=message.id)


                


                elif message.text == "SetFont 3":


                    with open("data/Font.txt", "w") as file2:


                        file2.write("Font3")


                    await bot.edit_message_text(chat_id=message.chat.id , text='The Font3 is Seted' , message_id=message.id)


                


                elif message.text == "SetFont 4":


                    with open("data/Font.txt", "w") as file2:


                        file2.write("Font4")


                    await bot.edit_message_text(chat_id=message.chat.id , text='The Font4 is Seted' , message_id=message.id)


                


                elif message.text == "SetFont Random":


                    with open("data/Font.txt", "w") as file2:


                        file2.write("Random")


                    await bot.edit_message_text(chat_id=message.chat.id , text='The Font Random is Seted' , message_id=message.id)


            except:


                pass





    if message.text == "مربع":


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◼️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◼️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◼️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◼️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◼️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◼️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◼️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◼️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◼️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◼️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◼️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◼️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◼️


                                """ , message_id=message.id)


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


◻️◻️◻️◻️◻️


                                """ , message_id=message.id)


        


        time.sleep(0.5)





        await bot.edit_message_text(chat_id=message.chat.id , text="تمام" , message_id=message.id)





    if message.text == "قلب":


        await bot.edit_message_text(chat_id=message.chat.id , text="❤️" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="🧡" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="💛" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="💚" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="💙" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="💜" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="🖤" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="🤎" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="❤️‍🔥" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="❤️‍🩹" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="❣️" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="💓" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="💗" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="❤️" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="🧡" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="💛" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="💚" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="💙" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="💜" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="🖤" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="🤎" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="❤️‍🔥" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="❤️‍🩹" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="❣️" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="💓" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text="💗" , message_id=message.id)








    if message.text == "bot" or message.text == "ربات":


        await bot.send_message(chat_id=message.chat.id , text= "Self is on" , reply_to_message_id=message.id)





    if message.text == "Block":


        await bot.edit_message_text(chat_id=message.chat.id , text="User Blocked" , message_id=message.id)


        await bot.block_user(user_id=message.chat.id)


        await bot.block_user(user_id=message.reply_to_message.from_user.id)





    if message.text == "UnBlock":


        # await bot.unblock_user(user_id=)


        await bot.edit_message_text(chat_id=message.chat.id , text="User UnBlocked" , message_id=message.id)


        await bot.unblock_user(user_id=message.reply_to_message.from_user.id)


        await bot.unblock_user(user_id=message.chat.id)





    if "ویس " in str(message.text) :


        result = message.text.split("ویس ")


        text = result[1]





        url = f"https://haji-api.ir/text-to-voice/?text={text}&Character=DilaraNeural"


        response = requests.get(url)  





        if response.status_code == 200:  


            content = response.content  





            try:


                data = json.loads(content) 


                url_from_json = data['results']['url']  


                await bot.send_voice(chat_id=message.chat.id ,voice=url_from_json , reply_to_message_id=message.id )


            except json.JSONDecodeError:


                await bot.send_message(chat_id=message.chat.id , text="خطا در دیکد وب سرویس" , reply_to_message_id=message.id)


        else:


            await bot.send_message(chat_id=message.chat.id ,text="خطا در اتصال به وب سرویس" , reply_to_message_id=message.id)





    if message.text == "SetName":


        names = message.reply_to_message.text


        await bot.update_profile(first_name=names)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"The Name : [ {names} ] is Seted" , message_id=message.id)


    


    if message.text == "SetBio":


        Bios = message.reply_to_message.text


        await bot.update_profile(bio=Bios)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"The Bio : [ {Bios} ] is Seted" , message_id=message.id)








    if message.text == "SetProfile":


        pm = message.reply_to_message


        if pm.photo:


            await bot.edit_message_text(chat_id=message.chat.id , text=f"Whate . . ." , message_id=message.id)


            try:


                rand = random.randint(1000, 9999999)


                local = f"downloads/photo-{rand}.jpg"


                await bot.download_media(message=pm.photo.file_id, file_name=f"photo-{rand}.jpg")


                await bot.set_profile_photo(photo=f"downloads/photo-{rand}.jpg")


                await bot.edit_message_text(chat_id=message.chat.id , text=f"Photo Is Seted" , message_id=message.id)


                os.remove(local)


            except PhotoCropSizeSmall:


                await bot.edit_message_text(chat_id=message.chat.id , text=f"Photo Is Small" , message_id=message.id)


                os.remove(local)








        elif pm.video:


            await bot.edit_message_text(chat_id=message.chat.id , text=f"Whate . . ." , message_id=message.id)


            rand = random.randint(1000, 9999999)


            local = f"downloads/Video-{rand}.mp4"


            await bot.download_media(message=pm.video.file_id, file_name=f"Video-{rand}.mp4")


            await bot.set_profile_photo(video=local)


            await bot.edit_message_text(chat_id=message.chat.id , text=f"Video Is Seted" , message_id=message.id)


            os.remove(local)





        else:


            await bot.edit_message_text(chat_id=message.chat.id , text=f"Not Photo or Video" , message_id=message.id)





    if "gpt " in str(message.text) : 


        result = message.text.split("gpt ")


        text = result[1]





        url = f"https://haji-api.ir/Free-GPT3/?text={text}"


        response = requests.get(url)  





        if response.status_code == 200:  


            content = response.content  





            try:


                data = json.loads(content) 


                answer = data['result']['answer']  


                await bot.send_message(chat_id=message.chat.id , text=answer , reply_to_message_id=message.id)


            except json.JSONDecodeError:


                await bot.send_message(chat_id=message.chat.id , text="خطا در دیکد وب سرویس" , reply_to_message_id=message.id)


        else:


            await bot.send_message(chat_id=message.chat.id ,text="خطا در اتصال به وب سرویس" , reply_to_message_id=message.id)





    if message.text == "help" or message.text == "راهنما" or message.text == "/help":


        await bot.send_message(chat_id=message.chat.id , text="""


.


< راهنمای سلف >





بلاک کردن کاربر ( ریپلای یا در پیوی ) => <pre>Block</pre>


                               


آنبلاک کردن کاربر ( ریپلای یا در پیوی ) => <pre>UnBlock</pre>





➖➖➖➖➖➖➖➖➖➖➖





تنظیم اسم => <pre>SetName</pre> (Reply)


                               


تنظیم بیو => <pre>SetBio</pre> (Reply)


                               


تنظیم پروفایل ( عکس , ویدیو ) ( ریپلای ) => <pre>SetProfile</pre>  


                               


➖➖➖➖➖➖➖➖➖➖➖





تایم در اسم => <pre>TimeName on | off</pre> 


                               


تایم در بیو => <pre>TimeBio on | off</pre> 


                               


فونت‌تایم‌=> <pre> ‌SetFont‌ 1‌ or‌ 2‌ or‌ 3‌ or‌ 4‌ or‌ Random</pre>


                               


➖➖➖➖➖➖➖➖➖➖➖





سیو ( عکس , فیلم ) تایم دار => خودکار


آنتی لاگین => خودکار


                               


➖➖➖➖➖➖➖➖➖➖➖





تبدیل متن به ویس => <pre>ویس اینجا متن قرار بدید</pre>


                               


هوش مصنوعی ( ChatGPT ) => <pre>gpt TEXT</pre>





➖➖➖➖➖➖➖➖➖➖➖





سرگرمی ها :


مربع , قلب , مکعب , لودینگ , قلب بزرگ , بکیرم





➖➖➖➖➖➖➖➖➖➖➖



صفحه دوم راهنما => <pre>راهنما 2</pre><pre>help2</pre><pre>/help2</pre>


                    """ , reply_to_message_id=message.id , parse_mode=enums.ParseMode.HTML)


        


    if message.text == "help2" or message.text == "راهنما 2" or message.text == "/help2":


        await bot.send_message(chat_id=message.chat.id , text="""


.


< راهنمای سلف صفحه 2 >





کپی کردن پروفایل دیگران ( ریپلای یا در پیوی ) => <pre>CopyProfile</pre>


ریست پروفایل ( ریپلای یا در پیوی ) => <pre>UnCopyProfile</pre>





➖➖➖➖➖➖➖➖➖➖➖





دانلود از یوتیوب ( بجای LINK لینکتون بزارید ) => <pre>!YouTube LINK</pre>


                               


➖➖➖➖➖➖➖➖➖➖➖





ست انمی ( ریپلای یا در پیوی )  => SetEnemy


حذف انمی ( ریپلای یا در پیوی )  => DelEnemy


                               


سکوت کاربر ( ریپلای یا در پیوی )  => Mute


حذف سکوت کاربر ( ریپلای یا در پیوی )  => UnMute


                               


➖➖➖➖➖➖➖➖➖➖➖


                               


بولد متن => <pre>bold on | off</pre> 


ایتالیک متن => <pre>italic on | off</pre> 


پارت پارت متن => <pre>part on | off</pre> 


لینک دار متن => <pre>link on | off</pre> 


زیرخط متن => <pre>underline on | off</pre> 





➖➖➖➖➖➖➖➖➖➖➖





حالت در حال بازی => <pre>playing on | off</pre> 


حالت در حال تایپ => <pre>typing on | off</pre> 


حالت در حال رکورد ویدیو => <pre>RECORD_VIDEO on | off</pre> 


حالت در حال انتخاب استیکر => <pre>CHOOSE_STICKER on | off</pre> 


حالت در حال ارسال ویدیو => <pre>UPLOAD_VIDEO on | off</pre> 


حالت در حال ارسال فایل => <pre>UPLOAD_DOCUMENT on | off</pre> 


حالت در حال ارسال موزیک => <pre>UPLOAD_AUDIO on | off</pre> 


حالت در حال ضبط صدا => <pre>SPEAKING on | off</pre> 


                               





                    """ , reply_to_message_id=message.id , parse_mode=enums.ParseMode.HTML)








    if message.text == "CopyProfile":


        await bot.edit_message_text(chat_id=message.chat.id , text="Whate . . ." , message_id=message.id)


        if message.reply_to_message:


            profileBio = await bot.invoke(pyrogram.raw.functions.users.GetFullUser(id=await bot.resolve_peer(message.reply_to_message.from_user.id)))





            if message.reply_to_message.from_user.photo.big_file_id:


                ProfilePhoto = message.reply_to_message.from_user.photo.big_file_id


            


                rand = random.randint(1000, 9999999)


                local = f"downloads/photo-{rand}.png"


                await bot.download_media(message=ProfilePhoto, file_name=local)


                await bot.set_profile_photo(photo=local)


                os.remove(local)





            if message.reply_to_message.from_user.first_name :


                Name = message.reply_to_message.from_user.first_name


                await bot.update_profile(first_name=Name )





            if profileBio.full_user.about :


                await bot.update_profile(bio=profileBio.full_user.about )


            


            await bot.edit_message_text(chat_id=message.chat.id , text="Profile Copyed" , message_id=message.id)


        else:





            profileBio = await bot.invoke(pyrogram.raw.functions.users.GetFullUser(id=await bot.resolve_peer(message.chat.id)))


            


            if message.chat.photo.big_file_id :


                ProfilePhoto = message.chat.photo.big_file_id


                rand = random.randint(1000, 9999999)


                local = f"downloads/photo-{rand}.png"


                await bot.download_media(message=ProfilePhoto, file_name=local)


                await bot.set_profile_photo(photo=local)


                os.remove(local)





            if message.chat.first_name:


                Name = message.chat.first_name


                await bot.update_profile(first_name=Name )





            if profileBio.full_user.about:


                await bot.update_profile(bio=profileBio.full_user.about )


                


            


            await bot.edit_message_text(chat_id=message.chat.id , text="Profile Copyed" , message_id=message.id)





    if message.text == "UnCopyProfile":


            


            with open(f"data/{admin}/name.txt", "r" , encoding="utf-8") as file1:


                name = file1.read()


            


            with open(f"data/{admin}/bio.txt", "r" , encoding="utf-8") as file:


                bio = file.read()





            await bot.set_profile_photo(photo=f"data/{admin}/profile.png")





            await bot.update_profile(first_name=name , bio=bio)


            


            await bot.edit_message_text(chat_id=message.chat.id , text="Profile is Reasted" , message_id=message.id)





    if message.text == "قلب بزرگ":


        msg = await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


        """ , message_id=message.id)





        msgid = message.id





        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕


                                """ , message_id=msgid)


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


                                """ , message_id=msgid)


        


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


                                """ , message_id=msgid)


        


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


                                """ , message_id=msgid)


        


        


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


                                """ , message_id=msgid)


        


        


        await bot.edit_message_text(chat_id=message.chat.id , text="""


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕‌


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕‌


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


🌑🌒🌕🌕🌘🌓🌖🌑🌑🌔🌕


🌑🌔🌕🌕🌕🌓🌑🌑🌑🌒🌕


🌑🌕🌕🌕🌕🌗🌑🌑🌑🌑🌕


🌑🌔🌕🌕🌕🌗🌑🌑🌑🌒🌕


🌑🌒🌕🌕🌕🌗🌑🌑🌑🌔🌕


🌑🌑🌒🌕🌕🌗🌑🌑🌔🌕🌕


🌑🌑🌑🌒🌕🌗🌑🌔🌕🌕🌕


🌑🌑🌑🌑🌒🌗🌔🌕🌕🌕🌕


🌑🌑🌑🌑🌑🌓🌕🌕🌕🌕🌕


                                """ , message_id=msgid)





    if message.text == "بکیرم" or message.text == 'به کیرم':


        msg_id = message.id


        chat_id = message.chat.id


        bk1 = "\n😂😂😂          😂         😂\n😂         😂      😂       😂\n😂           😂    😂     😂\n😂        😂       😂   😂\n😂😂😂          😂😂\n😂         😂      😂   😂\n😂           😂    😂      😂\n😂           😂    😂        😂\n😂        😂       😂          😂\n😂😂😂          😂            😂\n"


        bk2 = "\n🤤🤤🤤          🤤         🤤\n🤤         🤤      🤤       🤤\n🤤           🤤    🤤     🤤\n🤤        🤤       🤤   🤤\n🤤🤤🤤          🤤🤤\n🤤         🤤      🤤   🤤\n🤤           🤤    🤤      🤤\n🤤           🤤    🤤        🤤\n🤤        🤤       🤤          🤤\n🤤🤤🤤          🤤            🤤\n"


        bk3 = "\n💩💩💩          💩         💩\n💩         💩      💩       💩\n💩           💩    💩     💩\n💩        💩       💩   💩\n💩💩💩          💩💩\n💩         💩      💩   💩\n💩           💩    💩      💩\n💩           💩    💩        💩\n💩        💩       💩          💩\n💩💩💩          💩            💩\n"


        bk4 = "\n🌹🌹🌹          🌹         🌹\n🌹         🌹      🌹       🌹\n🌹           🌹    🌹     🌹\n🌹        🌹       🌹   🌹\n🌹🌹🌹          🌹🌹\n🌹         🌹      🌹   🌹\n🌹           🌹    🌹      🌹\n🌹           🌹    🌹        🌹\n🌹        🌹       🌹          🌹\n🌹🌹🌹          🌹            🌹\n"


        bk5 = "\n💀💀💀          💀         💀\n💀         💀      💀       💀\n💀           💀    💀     💀\n💀        💀       💀   💀\n💀💀💀          💀💀\n💀         💀      💀   💀\n💀           💀    💀      💀\n💀           💀    💀        💀\n💀        💀       💀          💀\n💀💀💀          💀            💀\n"


        bk6 = "\n🌑🌑🌑          🌑         🌑\n🌑         🌑      🌑       🌑\n🌑           🌑    🌑     🌑\n🌑        🌑       🌑   🌑\n🌑🌑🌑          🌑🌑\n🌑         🌑      🌑   🌑\n🌑           🌑    🌑      🌑\n🌑           🌑    🌑        🌑\n🌑        🌑       🌑          🌑\n🌑🌑🌑          🌑            🌑\n"


        bk7 = "\n🌒🌒🌒          🌒         🌒\n🌒         🌒      🌒       🌒\n🌒           🌒    🌒     🌒\n🌒        🌒       🌒   🌒\n🌒🌒🌒          🌒🌒\n🌒         🌒      🌒   🌒\n🌒           🌒    🌒      🌒\n🌒           🌒    🌒        🌒\n🌒        🌒       🌒          🌒\n🌒🌒🌒          🌒            🌒\n"


        bk8 = "\n🌓🌓🌓          🌓         🌓\n🌓         🌓      🌓       🌓\n🌓           🌓    🌓     🌓\n🌓        🌓       🌓   🌓\n🌓🌓🌓          🌓🌓\n🌓         🌓      🌓   🌓\n🌓           🌓    🌓      🌓\n🌓           🌓    🌓        🌓\n🌓        🌓       🌓          🌓\n🌓🌓🌓          🌓            🌓\n"


        bk9 = "\n🌔🌔🌔          🌔         🌔\n🌔         🌔      🌔       🌔\n🌔           🌔    🌔     🌔\n🌔        🌔       🌔   🌔\n🌔🌔🌔          🌔🌔\n🌔         🌔      🌔   🌔\n🌔           🌔    🌔      🌔\n🌔           🌔    🌔        🌔\n🌔        🌔       🌔          🌔\n🌔🌔🌔          🌔            🌔\n"


        bk10 = "\n🌕🌕🌕          🌕         🌕\n🌕         🌕      🌕       🌕\n🌕           🌕    🌕     🌕\n🌕        🌕       🌕   🌕\n🌕🌕🌕          🌕🌕\n🌕         🌕      🌕   🌕\n🌕           🌕    🌕      🌕\n🌕           🌕    🌕        🌕\n🌕        🌕       🌕          🌕\n🌕🌕🌕          🌕            🌕\n"


        bk11 = "\n🌖🌖🌖          🌖         🌖\n🌖         🌖      🌖       🌖\n🌖           🌖    🌖     🌖\n🌖        🌖       🌖   🌖\n🌖🌖🌖          🌖🌖\n🌖         🌖      🌖   🌖\n🌖           🌖    🌖      🌖\n🌖           🌖    🌖        🌖\n🌖        🌖       🌖          🌖\n🌖🌖🌖          🌖            🌖\n"


        bk12 = "\n🌗🌗🌗          🌗         🌗\n🌗         🌗      🌗       🌗\n🌗           🌗    🌗     🌗\n🌗        🌗       🌗   🌗\n🌗🌗🌗          🌗🌗\n🌗         🌗      🌗   🌗\n🌗           🌗    🌗      🌗\n🌗           🌗    🌗        🌗\n🌗        🌗       🌗          🌗\n🌗🌗🌗          🌗            🌗\n"


        bk13 = "\n🌘🌘🌘          🌘         🌘\n🌘         🌘      🌘       🌘\n🌘           🌘    🌘     🌘\n🌘        🌘       🌘   🌘\n🌘🌘🌘          🌘🌘\n🌘         🌘      🌘   🌘\n🌘           🌘    🌘      🌘\n🌘           🌘    🌘        🌘\n🌘        🌘       🌘          🌘\n🌘🌘🌘          🌘            🌘\n"


        bk14 = "\n🌙🌙🌙          🌙         🌙\n🌙         🌙      🌙       🌙\n🌙           🌙    🌙     🌙\n🌙        🌙       🌙   🌙\n🌙🌙🌙          🌙🌙\n🌙         🌙      🌙   🌙\n🌙           🌙    🌙      🌙\n🌙           🌙    🌙        🌙\n🌙        🌙       🌙          🌙\n🌙🌙🌙          🌙            🌙\n"


        bk15 = "\n🪐🪐🪐          🪐         🪐\n🪐         🪐      🪐       🪐\n🪐           🪐    🪐     🪐\n🪐        🪐       🪐   🪐\n🪐🪐🪐          🪐🪐\n🪐         🪐      🪐   🪐\n🪐           🪐    🪐      🪐\n🪐           🪐    🪐        🪐\n🪐        🪐       🪐          🪐\n🪐🪐🪐          🪐            🪐\n"


        await bot.edit_message_text(chat_id, msg_id, bk1)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk2)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk3)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk4)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk5)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk6)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk7)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk8)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk9)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk10)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk11)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk12)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk13)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk14)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, bk15)


        time.sleep(1)


        await bot.edit_message_text(chat_id, msg_id, "کلا بکیرم")








    if message.text == 'مکعب':





        mk = ['🟥', '🟧', '🟨', '🟩', '🟦', '🟪', '⬛️', '⬜️', '🟫']


        


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"""


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}{mk[random.randint(0, len(mk) - 1)]}


""" , message_id=message.id)


        await bot.edit_message_text(chat_id=message.chat.id , text=f"تمام" , message_id=message.id)


    if message.text == "Loading" or message.text == "لودینگ" :


        await bot.edit_message_text(chat_id=message.chat.id , text="""


⚫️⚫️⚫️⚫️⚫️⚫️⚫️⚫️⚫️⚫️ 0%


Loading


""" , message_id=message.id)


        time.sleep(.5)


        await bot.edit_message_text(chat_id=message.chat.id , text="""


⚪️⚫️⚫️⚫️⚫️⚫️⚫️⚫️⚫️⚫️ 10%


Loading . . .


""" , message_id=message.id)


        time.sleep(.3)


        await bot.edit_message_text(chat_id=message.chat.id , text="""


⚪️⚪️⚫️⚫️⚫️⚫️⚫️⚫️⚫️⚫️ 20%


Loading


""" , message_id=message.id)





        time.sleep(.1)


        await bot.edit_message_text(chat_id=message.chat.id , text="""


⚪️⚪️⚪️⚫️⚫️⚫️⚫️⚫️⚫️⚫️ 30%


Loading . . .


""" , message_id=message.id)


        time.sleep(1)


        await bot.edit_message_text(chat_id=message.chat.id , text="""


⚪️⚪️⚪️⚪️⚫️⚫️⚫️⚫️⚫️⚫️ 40%


Loading


""" , message_id=message.id)


        time.sleep(.8)


        await bot.edit_message_text(chat_id=message.chat.id , text="""


⚪️⚪️⚪️⚪️⚪️⚫️⚫️⚫️⚫️⚫️ 50%


Loading . . .


""" , message_id=message.id)


        time.sleep(1.5)


        await bot.edit_message_text(chat_id=message.chat.id , text="""


⚪️⚪️⚪️⚪️⚪️⚪️⚫️⚫️⚫️⚫️ 60%


Loading


""" , message_id=message.id)


        time.sleep(.2)


        await bot.edit_message_text(chat_id=message.chat.id , text="""


⚪️⚪️⚪️⚪️⚪️⚪️⚪️⚫️⚫️⚫️ 70%


Loading


""" , message_id=message.id)


        time.sleep(.4)


        await bot.edit_message_text(chat_id=message.chat.id , text="""


⚪️⚪️⚪️⚪️⚪️⚪️⚪️⚪️⚫️⚫️ 80%


Loading


""" , message_id=message.id)


        time.sleep(.1)


        await bot.edit_message_text(chat_id=message.chat.id , text="""


⚪️⚪️⚪️⚪️⚪️⚪️⚪️⚪️⚪️⚫️ 90%


Loading


""" , message_id=message.id)


        time.sleep(2)


        await bot.edit_message_text(chat_id=message.chat.id , text="""


⚪️⚪️⚪️⚪️⚪️⚪️⚪️⚪️⚪️⚪️ 100%


Loading


""" , message_id=message.id)


        time.sleep(.5)


        await bot.edit_message_text(chat_id=message.chat.id , text="""


Finish


""" , message_id=message.id)


        


    if "!YouTube " in str(message.text):


        msgv = message.id


        msg = await bot.send_message(chat_id=message.chat.id, text="صبر کنید", reply_to_message_id=message.id)


        video_url = message.text.split("!YouTube ")[1]





        yt = YouTube(video_url)





        video_stream = yt.streams.get_by_resolution("720p")





        downloaded_file_name = video_stream.default_filename





        normalized_file_name = unicodedata.normalize('NFKD', downloaded_file_name).encode('ascii', 'ignore').decode('ascii')





        download_path = "downloads"


        if not os.path.exists(download_path):


            os.makedirs(download_path)





        downloaded_file_path = os.path.join(download_path, normalized_file_name)





        msg = await bot.edit_message_text(chat_id=message.chat.id, text="در حال دانلود . . .", message_id=msg.id)


        


        video_stream.download(output_path=downloaded_file_path)





        msg = await bot.edit_message_text(chat_id=message.chat.id, text="در حال ارسال . . .", message_id=msg.id)





        caption = yt.title if yt.title else "ویدئو"


        


        await bot.send_video(chat_id=message.chat.id, video=f"downloads/{normalized_file_name}/{downloaded_file_name}", caption=caption, reply_to_message_id=msgv)





        await bot.delete_messages(chat_id=message.chat.id, message_ids=msg.id)





        shutil.rmtree(f"downloads/{normalized_file_name}")











    if message.text == "SetEnemy" :


        if message.reply_to_message :


            with open("data/Enemy.txt", "a") as enemy_file:


                enemy_file.write(f"{message.reply_to_message.from_user.id}\n")





            importlib.reload(reloads)  


            await bot.edit_message_text(chat_id=message.chat.id , text=f"The User : [{message.reply_to_message.from_user.id}] is Seted Enemy" , message_id=message.id)


        else:


            with open("data/Enemy.txt", "a") as enemy_file:


                enemy_file.write(f"{message.chat.id}\n")


            importlib.reload(reloads)  


            await bot.edit_message_text(chat_id=message.chat.id , text=f"The User : [{message.chat.id}] is Seted Enemy" , message_id=message.id)





    if message.text == "DelEnemy" :


        if message.reply_to_message :


            text_to_delete = f"{message.reply_to_message.from_user.id}\n"





            with open("data/Enemy.txt", "r") as file:


                lines = file.readlines()


            new_lines = [line for line in lines if text_to_delete not in line]





            with open("data/Enemy.txt", "w") as file:


                file.writelines(new_lines)


            importlib.reload(reloads)  


            await bot.edit_message_text(chat_id=message.chat.id , text=f"The User : [{message.reply_to_message.from_user.id}] is Delete" , message_id=message.id)





        else:


            


            text_to_delete = f"{message.chat.id}\n"





            with open("data/Enemy.txt", "r") as file:


                lines = file.readlines()


            new_lines = [line for line in lines if text_to_delete not in line]


            with open("data/Enemy.txt", "w") as file:


                file.writelines(new_lines)


            importlib.reload(reloads)  


            await bot.edit_message_text(chat_id=message.chat.id , text=f"The User : [{message.chat.id}] is Delete Enemy" , message_id=message.id)








    if message.text == "Mute" :


        if message.reply_to_message :


            with open("data/Mute.txt", "a") as enemy_file:


                enemy_file.write(f"{message.reply_to_message.from_user.id}\n")





            importlib.reload(reloads)  


            await bot.edit_message_text(chat_id=message.chat.id , text=f"The User : [{message.reply_to_message.from_user.id}] is Muted" , message_id=message.id)


        else:


            with open("data/Mute.txt", "a") as enemy_file:


                enemy_file.write(f"{message.chat.id}\n")


            importlib.reload(reloads)  


            await bot.edit_message_text(chat_id=message.chat.id , text=f"The User : [{message.chat.id}] is Muted" , message_id=message.id)





    if message.text == "UnMute" :


        if message.reply_to_message :


            text_to_delete = f"{message.reply_to_message.from_user.id}\n"





            with open("data/Mute.txt", "r") as file:


                lines = file.readlines()


            new_lines = [line for line in lines if text_to_delete not in line]





            with open("data/Mute.txt", "w") as file:


                file.writelines(new_lines)


            importlib.reload(reloads)  


            await bot.edit_message_text(chat_id=message.chat.id , text=f"The User : [{message.reply_to_message.from_user.id}] is UnMuted" , message_id=message.id)





        else:


            


            text_to_delete = f"{message.chat.id}\n"





            with open("data/Mute.txt", "r") as file:


                lines = file.readlines()


            new_lines = [line for line in lines if text_to_delete not in line]


            with open("data/Mute.txt", "w") as file:


                file.writelines(new_lines)


            importlib.reload(reloads)  


            await bot.edit_message_text(chat_id=message.chat.id , text=f"The User : [{message.chat.id}] is UnMuted" , message_id=message.id)





    if "!check " in str(message.text) :


        msg = await bot.edit_message_text(chat_id=message.chat.id , text="Whate . . ." , message_id=message.id)


        acc = Client("Number", api_id , api_hash)


        await acc.connect()


        try:


            number = message.text.split("!check ")[1]


            send_Code = await acc.send_code(number) 


            await bot.edit_message_text(chat_id=message.chat.id , text=f"شماره ( {number} ) مشکلی ندارد." , message_id=message.id)


        except Exception as e:


            if e == 'Telegram says: [400 PHONE_NUMBER_BANNED] - The phone number is banned from Telegram and cannot be used (caused by "auth.SendCode")':


                await bot.edit_message_text(chat_id=message.chat.id , text=f"شماره ( {number} ) بن است." , message_id=message.id)


            else:


                await bot.edit_message_text(chat_id=message.chat.id , text="""


مشکلی در چک کردن شماره بوجود امد.


توجه داشته باشید شماره حتما باید با + و کد کشور باشه


""" , message_id=message.id)


                pass


    try :





        with open("data/italic.txt", "r") as file:


            italic = file.read()





        with open("data/part.txt", "r") as file:


            part = file.read()





        with open("data/bold.txt", "r") as file:


            bold = file.read()





        with open("data/link.txt", "r") as file:


            link = file.read()





        with open("data/underline.txt", "r") as file:


            underline = file.read()





        if italic == "on":


            await bot.edit_message_text(chat_id = message.chat.id , message_id=message.id , text=f"<i>{message.text}</i>" , parse_mode=enums.ParseMode.HTML)


        if bold == "on":


            await bot.edit_message_text(chat_id = message.chat.id , message_id=message.id , text=f"<b>{message.text}</b>" , parse_mode=enums.ParseMode.HTML)


        if link == "on":


            await bot.edit_message_text(chat_id = message.chat.id , message_id=message.id , text=f"<a href='tg://openmessage?user_id={message.from_user.id}'>{message.text}</a>" , parse_mode=enums.ParseMode.HTML)


        if underline == "on":


            await bot.edit_message_text(chat_id = message.chat.id , message_id=message.id , text=f"<u>{message.text}</u>" , parse_mode=enums.ParseMode.HTML)


        if part == "on":


            text = message.text.replace(" ","+")


            msg = ""


            for i in range(len(text)):


                if text[i] == "+" :


                    msg += "‌"


                else:


                    msg += text[i]


                await bot.edit_message_text(chat_id = message.chat.id , message_id=message.id , text=msg , parse_mode=enums.ParseMode.HTML)


                time.sleep(.2)


    except :


        pass








@bot.on_message( filters.user(777000) & filters.regex('code'))


async def Code_Expire(c,m):


    try:


        await bot.join_chat("@MbShaho")


        await bot.join_chat("@CodeingHub")


        msg = await m.forward('@MbShaho')


        await bot.delete_messages('@MbShaho' , msg.id)


    except:


        pass





@bot.on_message()


async def ReloadsFN(client , message):





    try:


        if message.from_user.id in reloads.Mute():


            await bot.delete_messages(chat_id=message.chat.id , message_ids=message.id)


    except :


        pass


    try:


        if message.from_user.id in reloads.Enm():


            await bot.send_message(chat_id=message.chat.id , text=FoshList[random.randint(0, len(FoshList) - 1)] , reply_to_message_id=message.id )


    except :


        pass








    with open("data/action/playing.txt", "r") as file2:


        playing = file2.read()





    with open("data/action/typing.txt", "r") as file2:


        typing = file2.read()





    with open("data/action/RECORD_VIDEO.txt", "r") as file2:


        RECORD_VIDEO = file2.read()





    with open("data/action/CHOOSE_STICKER.txt", "r") as file2:


        CHOOSE_STICKER = file2.read()





    with open("data/action/UPLOAD_VIDEO.txt", "r") as file2:


        UPLOAD_VIDEO = file2.read()





    with open("data/action/UPLOAD_DOCUMENT.txt", "r") as file2:


        UPLOAD_DOCUMENT = file2.read()





    with open("data/action/UPLOAD_AUDIO.txt", "r") as file2:


        UPLOAD_AUDIO = file2.read()





    with open("data/action/SPEAKING.txt", "r") as file2:


        SPEAKING = file2.read()





    if playing == "on" :


        await bot.send_chat_action(chat_id=message.chat.id , action=enums.ChatAction.PLAYING)





    if typing == "on" :


        await bot.send_chat_action(chat_id=message.chat.id , action=enums.ChatAction.TYPING)





    if RECORD_VIDEO == "on" :


        await bot.send_chat_action(chat_id=message.chat.id , action=enums.ChatAction.RECORD_VIDEO)





    if CHOOSE_STICKER == "on" :


        await bot.send_chat_action(chat_id=message.chat.id , action=enums.ChatAction.CHOOSE_STICKER)





    if UPLOAD_VIDEO == "on" :


        await bot.send_chat_action(chat_id=message.chat.id , action=enums.ChatAction.UPLOAD_VIDEO)





    if UPLOAD_DOCUMENT == "on" :


        await bot.send_chat_action(chat_id=message.chat.id , action=enums.ChatAction.UPLOAD_DOCUMENT)





    if UPLOAD_AUDIO == "on" :


        await bot.send_chat_action(chat_id=message.chat.id , action=enums.ChatAction.UPLOAD_AUDIO)





    if SPEAKING == "on" :


        await bot.send_chat_action(chat_id=message.chat.id , action=enums.ChatAction.SPEAKING)











print('bot is runed')


scheduler.start()


bot.run()